<?php

namespace App\Landing\Service;

use App\Psiholog\Entity\Psiholog;

class PsihologProfileInfo
{
    private const THERAPY_TYPE_INDIVIDUAL = 'Individual';
    private const THERAPY_TYPE_COUPLE = 'Couple';
    private const THERAPY_TYPE_TEENAGER = 'Teenager';

    private const METHOD_GESTALT_THERAPY = 'Gestalt_therapy';
    private const METHOD_SYSTEMIC_FAMILY_THERAPY = 'Systemic_family_therapy';
    private const METHOD_CONSTELLATIONS = 'Constellations';
    private const METHOD_COACHING = 'Coaching';
    private const METHOD_ART_THERAPY = 'Art_therapy';
    private const METHOD_BODY_THERAPY = 'Body_therapy';
    private const METHOD_CLIENT_CENTERED_PSYCHOTHERAPY = 'Client_centered_psychotherapy';
    private const METHOD_COGNITIVE_BEHAVIORAL_THERAPY_CBT = 'Cognitive_behavioral_therapy_cbt';
    private const METHOD_PSYCHOANALYSIS = 'Psychoanalysis';
    private const METHOD_PSYCHODRAMA = 'Psychodrama';
    private const METHOD_EXISTENTIAL_THERAPY = 'Existential_therapy';
    private const METHOD_ACCEPTANCE_AND_COMMITMENT_THERAPY = 'Acceptance_and_commitment_therapy';
    private const METHOD_POSITIVE_PSYCHOTHERAPY = 'Positive_psychotherapy';


    private const PSIHOLOG_LIST = [
        Psiholog::PSIHOLOG_ID_MARIYA_KOROYED => [
            'singlePhrase' => 'gestalt_therapist_and_lgbt_friendly_psiholog',//"и гештальт терапевт",
            'specialties' => [//тут список "спеціалізацій" (це на сторінці списка психологів вони виводяться)
                "Sexology",
                "Crisis_and_trauma",
                "Organizational_consulting",
                "Interpersonal_relations" => true,
            ],
            'experience_years' => 5,//років досвіду
            'profile_courses' => 4,//профільних курсів
            'therapy_types' => [//види терапії
                self::THERAPY_TYPE_INDIVIDUAL,//
                self::THERAPY_TYPE_COUPLE,//парна
                self::THERAPY_TYPE_TEENAGER,//підліткова
            ],
            'about' => [//про психолога
                'ru' => "
                <p>
Я энергичная, внимательная, с уважением отношусь к инаковости другого. Я верю в уникальность каждого, и что эта уникальность имеет право проявляться во всех областях жизни. Готова быть рядом, когда трудно: слушать и слышать тебя, если надо выговориться; порадоваться вместе с тобой, твоим большим и маленьким успехам.
</p>

<p>
Темы с которыми точно ко мне:<br>
- Принятие себя.<br>
- Кризисы в браке и вообще в отношениях.<br>
- Сексуальность, женская идентичность.<br>
– Как не потерять себя как женщину, как личность, в семье и с ребенком. Как сохранить себя и быть нормальной женой и мамой.<br>
- Самореализация, карьера.<br>
- Финансовое поведение, стереотипы - почему не могу заработать, страхи.<br>
- Стыд предъявления.
</p>

<p>
Мне нравится что гештальт-терапия – это о глубине. Это не только поверхностное снятие симптома, с которым обращается клиент, это еще и проработка первопричины.
Гештальт-терапия – это лечение контактом. При работе я опираюсь на свои чувства, которые у меня появляются рядом с тобой, фигуры, которые у меня всплывают, догадки. Я принесу их в наш контакт, мы их обсудим и обнаружим проблему.
</p>

<p>
За свои 35 лет я проживала разные ситуации: взлеты, падения, выгорание, потеря смыслов в деятельности (12 лет я работала в сфере управления персоналом), развод и поиск нового, поэтому мне есть чем поделиться и есть чем понять ваши запросы.
И самое главное знания, которыми я могу быть вам полезна.
</p>
                ",
                'ua' => "
                <p>
Я енергійна, уважна, з повагою ставлюся до інаковості іншого. Я вірю в унікальність кожного, і що ця унікальність має право виявлятися у всіх сферах життя. Готова бути поряд, коли важко: слухати і чути тебе, якщо треба виговоритись; порадіти разом з тобою, твоїм великим та маленьким успіхам.
</p>

<p>
Теми з якими точно до мене:<br>
- Прийняття себе.<br>
- Кризи у шлюбі та взагалі в відносинах.<br>
- Сексуальність, жіноча ідентичність.<br>
- Як не втратити себе як жінку, як особистість, у сім'ї та з дитиною. Як зберегти себе і бути нормальною дружиною та мамою.<br>
- Самореалізація, кар’єра.<br>
- Фінансова поведінка, стереотипи - чому не можу заробити, страхи.<br>
- Сором пред'явлення.<br>
</p>

<p>
Мені подобається що гештальт-терапія -  це про глибину. Це не тільки поверхове зняття симптому, з яким звертається клієнт, це ще й опрацювання першопричини.
Гештальт-терапія - це лікування контактом. При роботі я спираюся на свої почуття, які у мене з'являються поряд з тобою, фігури, які у мене спливають, здогадки. Я принесу їх у наш контакт, ми їх обговоримо і через це виявимо проблему.
</p>

<p>
За свої 35 років я проживала різні ситуації: зльоти, падіння, вигоряння, втрату сенсів у діяльності (12 років я працювала у сфері управління персоналом), розлучення та пошук нового, тому мені є чим поділитися і є чим зрозуміти ваші запити.
І найголовніше є знання, якими я можу бути вам корисною.
</p> ",
            ],
            'works_with' => [//теми, з якими працює
                TopicList::STRESS,
                TopicList::ANXIETY,
                TopicList::DEPRESSION,
                TopicList::PANIC_ATTACKS,
                TopicList::DECLINE_OF_STRENGTH,
                TopicList::LOW_SELF_ESTEEM,
                TopicList::MOOD_SWINGS,
                TopicList::IRRITABILITY,
                TopicList::AGGRESSION,
                TopicList::SLEEP_PROBLEMS,
                TopicList::A_FEELING_OF_LONELINESS,
                TopicList::EMOTIONAL_DEPENDENCE,
                TopicList::RELATIONSHIP_WITH_A_PARTNER,
                TopicList::RELATIONS_WITH_PARENTS,
                TopicList::RELATIONSHIP_WITH_CHILDREN,
                TopicList::RELATIONSHIPS_IN_GENERAL_WITH_OTHERS,
                TopicList::SEXUAL_PROBLEMS_DISORDERS,
                TopicList::DIFFICULTIES_WITH_ORIENTATION_ITS_SEARCH,
                TopicList::BURNOUT,
                TopicList::LACK_OF_MOTIVATION,
                TopicList::PROCRASTINATION,
                TopicList::I_DON_T_KNOW_WHAT_I_WANT_TO_DO,
                TopicList::CHANGE_JOB_LOSS,
                TopicList::WAR,
                TopicList::MOVING_EMIGRATING,
                TopicList::PREGNANCY,
                TopicList::BIRTH_OF_A_CHILD,
                TopicList::FINANCIAL_CHANGES,
                TopicList::BREAKUP_OF_RELATIONS_DIVORCE,
                TopicList::TREASON,

            ],
            'education' => [//освіта
                'main_amount' => 2,//кількість основних освіт
                'additional_amount' => 5,//кількість додаткових освіт
                'list' => [
                    [
                        'years' => '2020-2022',
                        'name' => [
                            'ru' => 'Магистр психологии, «Межрегиональная академия управления персоналом»',
                            'ua' => 'Магістр психології, «Міжрегіональна академія управління персоналом»',
                        ]
                    ],
                    [
                        'years' => '2007-2011',
                        'name' => [
                            'ru' => 'Магистр социологии, «Академия труда и социальных отношений»',
                            'ua' => 'Магістр соціології, «Академія праці та соціальних відносин»',
                        ]
                    ],
                    [
                        'years' => '2018-2022',
                        'name' => [
                            'ru' => 'I и II ступень «Теория и практика в гештальт-терапии», «Украинский гештальт институт»',
                            'ua' => 'I та ІІ ступень «Теорія і практика в гештальт-терапії», «Український гештальт інститут»',
                        ]
                    ],
                    [
                        'years' => '2016-2019',
                        'name' => [
                            'ru' => 'Специализация "Организационное консультирование, гештальт подход"',
                            'ua' => 'Спеціалізація «Організаційне консультування, гештальт підхід»',
                        ]
                    ],
                    [
                        'years' => '2020-2022',
                        'name' => [
                            'ru' => 'Специализация «Сексология в гештальт подходе»',
                            'ua' => 'Спеціалізація «Сексологія в гештальт підході»',
                        ]
                    ],
                    [
                        'years' => '2020',
                        'name' => [
                            'ru' => 'Сертификат, «Гештальт коучинг',
                            'ua' => 'Сертифікат, «Гештальт коучинг»',
                        ]
                    ],
                ],
            ],
            'methods' => [
                self::METHOD_GESTALT_THERAPY,
                self::METHOD_COGNITIVE_BEHAVIORAL_THERAPY_CBT,
                self::METHOD_COACHING,
                self::METHOD_ART_THERAPY,
            ],
            'association_and_supervision' => [
                [
                    'ru' => 'Членкиня Всеукраинского Общества Психологов Практикующих Гештальт Подход, «Украинский Гештальт Институт»',
                    'ua' => 'Членкиня Всеукраїнської Спілки Психологів, що Практикують Гештальт Підхід, «Український Гештальт Інститут»',
                ],
                [
                    'ru' => 'Прошла 100 часов супервизии и 200+ часов личной терапии',
                    'ua' => 'Пройшла 100 годин супервізії та 200+ годин особистої терапії',
                ],
            ],
        ],
        Psiholog::PSIHOLOG_ID_VIKTORIYA_RADIY => [
            'singlePhrase' => 'family_psiholog', //клинический и семейный психолог
            'specialties' => [
                "Crisis_and_trauma",
                "Work_with_shock_trauma" => true,
                "Sexology",
            ],
            'experience_years' => 7,
            'profile_courses' => 6,
            'therapy_types' => [
                self::THERAPY_TYPE_INDIVIDUAL,
                self::THERAPY_TYPE_COUPLE,
                self::THERAPY_TYPE_TEENAGER,
            ],
            'about' => [
                'ru' => "
                <p>
Мне интересна психология человека, узнавать тайны и лабиринты психики, искать лечение потому, что болит. Психология – то, что когда-то помогло мне и я верю в силу поддержки и человеческого контакта.</p>

<p>
Я внимательно работаю с запросом клиента, постоянно обучаюсь и повышаю квалификацию. У меня есть собственный опыт прохождения через кризисы.
</p>
                ",
                'ua' => "
                <p>
                Мені цікава психологія людини, дізнаватися таємниці і лабіринти психіки, шукати лікування тому, що болить. Психологія - те, що колись допомогло мені і я вірю в силу підтримки та людського контакту.

</p>

                <p>
Я уважно працюю із запитом клієнта, постійно навчаюсь та підвищую кваліфікацію. Маю власний досвід проходження через кризи.
</p>
                ",
            ],
            'works_with' => [
                TopicList::STRESS,
                TopicList::ANXIETY,
                TopicList::DEPRESSION,
                TopicList::PANIC_ATTACKS,
                TopicList::DECLINE_OF_STRENGTH,
                TopicList::LOW_SELF_ESTEEM,
                TopicList::MOOD_SWINGS,
                TopicList::IRRITABILITY,
                TopicList::AGGRESSION,
                TopicList::SLEEP_PROBLEMS,
                TopicList::A_FEELING_OF_LONELINESS,
                TopicList::EMOTIONAL_DEPENDENCE,
                TopicList::HYPOCHONDRIA,
                TopicList::EATING_DISORDER,
                TopicList::RELATIONSHIP_WITH_A_PARTNER,
                TopicList::RELATIONS_WITH_PARENTS,
                TopicList::RELATIONSHIP_WITH_CHILDREN,
                TopicList::RELATIONSHIPS_IN_GENERAL_WITH_OTHERS,
                TopicList::SEXUAL_PROBLEMS_DISORDERS,
                TopicList::DIFFICULTIES_WITH_ORIENTATION_ITS_SEARCH,
                TopicList::BURNOUT,
                TopicList::LACK_OF_MOTIVATION,
                TopicList::PROCRASTINATION,
                TopicList::I_DON_T_KNOW_WHAT_I_WANT_TO_DO,
                TopicList::CHANGE_JOB_LOSS,
                TopicList::WAR,
                TopicList::LOSS_OF_A_LOVED_ONE,
                TopicList::MOVING_EMIGRATING,
                TopicList::PREGNANCY,
                TopicList::BIRTH_OF_A_CHILD,
                TopicList::FINANCIAL_CHANGES,
                TopicList::BREAKUP_OF_RELATIONS_DIVORCE,
                TopicList::TREASON,
                TopicList::VIOLENCE,
                TopicList::ILLNESS_RELATIVES,
                TopicList::PSYCHOSOMATICS,
            ],
            'education' => [
                'main_amount' => 1,
                'additional_amount' => 6,
                'list' => [
                    [
                        'years' => '2009 - 2011',
                        'name' => [
                            'ru' => 'Магистр по клинической психологии, «Киевский институт современной психологии и психотерапии»',
                            'ua' => 'Магістр з клінічної психології, «Київський інститут сучасної психології та психотерапії»',
                        ]
                    ],
                    [
                        'years' => '2015 - 2019',
                        'name' => [
                            'ru' => 'I и II ступень «Теория и практика в гештальт-терапии», «Украинский гештальт институт»',
                            'ua' => 'І та ІІ ступінь «Теорія та практика в гештальт-терапії», «Український гештальт інститут»',
                        ]
                    ],
                    [
                        'years' => '2015 - 2016',
                        'name' => [
                            'ru' => 'Специализация «Работа с сексуальной тематикой в Гештальт подходе',
                            'ua' => 'Спеціалізація «Робота з сексуальною тематикою в Гештальт підході»',
                        ]
                    ],
                    [
                        'years' => '2016 - 2017',
                        'name' => [
                            'ru' => 'Специализация «Теория развития в Гештальт подходе: Возрастные кризисы»',
                            'ua' => 'Спеціалізація «Теорія розвитку в Гештальт підході: Вікові кризи»',
                        ]
                    ],
                    [
                        'years' => '2019 - 2022',
                        'name' => [
                            'ru' => 'Программа «Системные семейные расстановки», Голованова Е.Г.',
                            'ua' => 'Програма «Системні сімейні розстановки», Голованова Є.Г.',
                        ]
                    ],
                    [
                        'years' => '2014',
                        'name' => [
                            'ru' => 'Программа по владению психодиагностическими методиками (Роршах, ММРИ, Сонди)',
                            'ua' => 'Програма з володіння психодіагностичними методиками (Роршах, ММРІ, Сонді)',
                        ]
                    ],
                    [
                        'years' => '2013',
                        'name' => [
                            'ru' => 'Танце-двигательная терапия, Костевич В',
                            'ua' => 'Танце-рухова терапія, Костевич В',
                        ]
                    ],
                ],
            ],
            'methods' => [
                self::METHOD_GESTALT_THERAPY,
                self::METHOD_BODY_THERAPY,
                self::METHOD_SYSTEMIC_FAMILY_THERAPY,
                self::METHOD_CONSTELLATIONS
            ],
            'association_and_supervision' => [
                [
                    'ru' => 'Членкиня Всеукраинского Общества Психологов Практикующих Гештальт Подход, «Украинский Гештальт Институт»',
                    'ua' => 'Членкиня Всеукраїнської Спілки Психологів, що Практикують Гештальт Підхід, «Український Гештальт Інститут»',
                ],
                [
                    'ru' => 'Прошла 100+ часов супервизии и 210 часов личной терапии',
                    'ua' => 'Пройшла 100+ годин супервізії та 210 годин особистої терапії',
                ],
            ],
        ],
        Psiholog::PSIHOLOG_ID_SAN_SATTARI => [
            'singlePhrase' => 'man_psiholog',
            'specialties' => [
                "Organizational_consulting",
            ],
            'experience_years' => 12,
            'isNotTherapist' => true,
            'profile_courses' => 4,
            'therapy_types' => [
                self::THERAPY_TYPE_INDIVIDUAL,
                self::THERAPY_TYPE_COUPLE,
            ],
            'about' => [
                'ru' => "
                <p>
Каждый человек рожден быть счастливым, я в это верю!
Но жизненные ситуации понемногу ломают нас, но все что сломано – можно отремонтировать, и в это я тоже верю.
Поэтому, для меня терапия – это составление разрозненных нечувствительных частиц личности в единое живое чудесное целое.</p>

<p>
Серые будни, насыщенные негативными мыслями и страданиями, реально превратить в разноцветные мгновения счастья. Депрессивную пассивность реально превратить в целенаправленное движение, наполненное уверенностью и радостью.
Поэтому я рад помогать всем, кто хочет изменить свою жизнь к лучшему!
За последние 12 лет я помог многим, но не забываю работать над личным здоровьем и развитием, чтобы делать свое дело качественнее!
</p>
                ",
                'ua' => "
                <p>
                Кожна людина народжена бути щасливою, я в це вірю!
Але життєві ситуації потрохи ламають нас, але все що зламано - можна відремонтувати, і в це я також вірю.
Тому, для мене терапія - це складання розрізнених нечутливих частинок особистості в єдине живе чудове ціле.

</p>

                <p>
Сірі будні, які насичені негативними думками та стражданнями, реально перетворити на різнокольорові миті щастя. Депресивну пасивність реально перетворити на цілеспрямований рух, наповнений впевненістю та радістю.
Тому я радий допомагати всім, хто хоче змінити своє життя на краще!
За останні 12 років я допоміг багатьом людям, але не забуваю працювати над особистим здоров'ям та розвитком, щоб робити свою справу якісніше!
</p>
                ",
            ],
            'works_with' => [
                TopicList::STRESS,
                TopicList::ANXIETY,
                TopicList::DEPRESSION,
                TopicList::DECLINE_OF_STRENGTH,
                TopicList::LOW_SELF_ESTEEM,
                TopicList::AGGRESSION,
                TopicList::A_FEELING_OF_LONELINESS,
                TopicList::EMOTIONAL_DEPENDENCE,
                TopicList::RELATIONSHIP_WITH_A_PARTNER,
                TopicList::RELATIONS_WITH_PARENTS,
                TopicList::RELATIONSHIPS_IN_GENERAL_WITH_OTHERS,
                TopicList::SEXUAL_PROBLEMS_DISORDERS,
                TopicList::DIFFICULTIES_WITH_ORIENTATION_ITS_SEARCH,
                TopicList::I_DON_T_KNOW_WHAT_I_WANT_TO_DO,
                TopicList::CHANGE_JOB_LOSS,
                TopicList::WAR,
                TopicList::MOVING_EMIGRATING,
                TopicList::BREAKUP_OF_RELATIONS_DIVORCE,
                TopicList::TREASON,
                TopicList::PSYCHOSOMATICS,
            ],
            'education' => [
                'main_amount' => 1,
                'additional_amount' => 4,
                'list' => [
                    [
                        'years' => '2011 - 2013',
                        'name' => [
                            'ru' => 'Магистр психологии, «Национальный педагогический университет им.М.П. Драгоманова»',
                            'ua' => 'Магістр психології, «Національний педагогічний університет ім.М.П. Драгоманова»',
                        ]
                    ],
                    [
                        'years' => '2019',
                        'name' => [
                            'ru' => 'Сертификат, "Нейробиология психотерапии". УИКПТ',
                            'ua' => 'Сертифікат, «Нейробіологія психотерапії». УІКПТ',
                        ]
                    ],
                    [
                        'years' => '2015',
                        'name' => [
                            'ru' => 'Специализация «Телесно-ориентированная терапия по методу В.Райха»',
                            'ua' => 'Спеціалізація «Тілесно-орієнтована терапія за методом В.Райха»',
                        ]
                    ],
                    [
                        'years' => '2010 - 2013',
                        'name' => [
                            'ru' => 'Программа «Клиент-центрированная терапия, коучинг и нейролингвистическое программирование»',
                            'ua' => 'Програма «Клієнт-центрована терапія, коучинг та нейролінгвістичне програмування»',
                        ]
                    ],
                    [
                        'name' => [
                            'ru' => 'Программа «Системные расстановки по Хеллингеру», М. Бурняшев, Т. Закаблук',
                            'ua' => 'Програма «Системні розстановки по Хеллінгеру», М.Бурняшев, Т.Закаблук',
                        ]
                    ],
                ],
            ],
            'methods' => [
                self::METHOD_BODY_THERAPY,
                self::METHOD_CLIENT_CENTERED_PSYCHOTHERAPY,
                self::METHOD_CONSTELLATIONS,
                self::METHOD_COACHING,
            ],
            'association_and_supervision' => [

                [
                    'ru' => 'Прошел 50+ часов супервизии и 50 часов личной терапии',
                    'ua' => 'Пройшов 50+ годин супервізії та 50 годин особистої терапії',
                ],
            ],
        ],
        Psiholog::PSIHOLOG_ID_INNA_KARASHCHUK => [
            'singlePhrase' => 'family_psiholog',
            'specialties' => [
                "Crisis_and_trauma" => true,
                "Interpersonal_relations",
                "Working_with_anxiety_and_depression",
            ],
            'experience_years' => 12,
            'profile_courses' => 10,
            'therapy_types' => [
                self::THERAPY_TYPE_INDIVIDUAL,
                self::THERAPY_TYPE_COUPLE,
                self::THERAPY_TYPE_TEENAGER,
            ],
            'about' => [
                'ru' => "
                <p>
Я являюсь дипломированным и аккредитованным специалистом в позитивной и детской психотерапии, терапии травмы.
К каждому клиенту ищу индивидуальный подход, продолжаю профессиональное обучение, посещаю семинары, тренинги, конференции. </p>

<p>
Про метод позитивной психотерапии я узнала от одногруппницы, и уже после первой интервизии я пришла домой с решением небольшой задачи, которая передо мной стояла (на то время). 
С тех пор мой мир изменился во многом. Новые друзья, новые смыслы, темы, в которые хочется погрузиться с головой, я снова обучаюсь и кайфую от процесса! Работаю в психологическом центре и в частной практике. И клиенты есть, и результаты у клиентов тоже есть. Потому что результаты уже есть у меня.
</p>

<p>
И вот почему – потому что я поверила, что другая, более осмысленная жизнь возможна, и она возможна у меня. Я стала больше понимать, что значит жить своей жизнью. Не на словах, а на деле. Я научилась превращать свои мечты в цели и пошагово их реализовывать. И теперь помогаю в этом другим. А если вы еще не нашли свой путь, то я могу вам в этом помочь.
</p>
                ",
                'ua' => "
                <p>
                Я дипломований і акредитований спеціаліст у позитивній і дитячій психотерапії, терапії травми.
До кожного клієнта шукаю індивідуальний підхід, продовжую професійне навчання, відвідую семінари, тренінги, конференції.
</p>

                <p>
Про метод позитивної психотерапії я дізналася від одногрупниці, і вже після першої інтервізії я прийшла додому з вирішенням невеликої задачі, яка переді мною стояла (на той час).
З того часу мій світ багато в чому змінився. Нові друзі, нові сенси, теми, в які хочеться поринути з головою, я знову навчаюсь і кайфую від процесу! Працюю в психологічному центрі та у приватній практиці. І клієнти є, і результати у клієнтів також є. Тому що я вже маю результати.
</p>
<p>
І ось чому – тому що я повірила, що інше, більш осмислене життя можливе, і воно можливе у мене. Я почала більше розуміти, що означає жити своїм життям. Не на словах, а на ділі. Я навчилася перетворювати свої мрії на цілі і покроково їх реалізовувати. І тепер допомагаю у цьому іншим. А якщо ви ще не знайшли свій шлях, то я можу вам допомогти.
</p>
                ",
            ],
            'works_with' => [
                TopicList::STRESS,
                TopicList::ANXIETY,
                TopicList::DEPRESSION,
                TopicList::PANIC_ATTACKS,
                TopicList::DECLINE_OF_STRENGTH,
                TopicList::LOW_SELF_ESTEEM,
                TopicList::MOOD_SWINGS,
                TopicList::IRRITABILITY,
                TopicList::AGGRESSION,
                TopicList::SLEEP_PROBLEMS,
                TopicList::A_FEELING_OF_LONELINESS,
                TopicList::EMOTIONAL_DEPENDENCE,
                TopicList::HYPOCHONDRIA,
                TopicList::RELATIONSHIP_WITH_A_PARTNER,
                TopicList::RELATIONS_WITH_PARENTS,
                TopicList::RELATIONSHIP_WITH_CHILDREN,
                TopicList::RELATIONSHIPS_IN_GENERAL_WITH_OTHERS,
                TopicList::DIFFICULTIES_WITH_ORIENTATION_ITS_SEARCH,
                TopicList::BURNOUT,
                TopicList::LACK_OF_MOTIVATION,
                TopicList::PROCRASTINATION,
                TopicList::I_DON_T_KNOW_WHAT_I_WANT_TO_DO,
                TopicList::CHANGE_JOB_LOSS,
                TopicList::WAR,
                TopicList::LOSS_OF_A_LOVED_ONE,
                TopicList::MOVING_EMIGRATING,
                TopicList::FINANCIAL_CHANGES,
                TopicList::BREAKUP_OF_RELATIONS_DIVORCE,
                TopicList::TREASON,
                TopicList::ILLNESS_RELATIVES,
                TopicList::PSYCHOSOMATICS,
            ],
            'education' => [
                'main_amount' => 1,
                'additional_amount' => 10,
                'list' => [
                    [
                        'years' => '2012-2016',
                        'name' => [
                            'ru' => 'Магистр психологии, «Национальный педагогический университет им М.П. Драгоманова»',
                            'ua' => 'Магістр психології, «Національний педагогічний університет ім. М.П. Драгоманова»',
                        ]
                    ],
                    [
                        'years' => '2017 - 2021',
                        'name' => [
                            'ru' => 'Сертифицированный психотерапевт в методе Позитивная психотерапия, сертификат Висбаденской Академии Позитивной Психотерапии',
                            'ua' => 'Сертифікований психотерапевт у методі Позитивна психотерапія, сертифікат Вісбаденської Академії Позитивної Психотерапії',
                        ]
                    ],
                    [
                        'years' => '2021',
                        'name' => [
                            'ru' => 'Сертификат «ОКР у детей и подростков: когнитивно-поведенческая интегративная модель терапии», Институт рационально-интуитивной психотерапии «Я»',
                            'ua' => 'Сертифікат «ОКР у дітей і підлітків: когнітивно-поведінкова інтегративна модель терапії», Інститут Раціонально-інтуїтивної психотерапії «Я»',
                        ]
                    ],
                    [
                        'years' => '2017 - 2018',
                        'name' => [
                            'ru' => 'Психиатрическая пропедевтика, «Школа развития психотерапии»',
                            'ua' => 'Психіатрична пропедевтика, «Школа розвитку психотерапії»',
                        ]
                    ],
                    [
                        'years' => '2015 - 2016',
                        'name' => [
                            'ru' => 'Консультант в методе Позитивная психотерапия, сертификат Висбаденской Академии Позитивной Психотерапии»',
                            'ua' => 'Консультант у методі Позитивна психотерапія, сертифікат Вісбаденської Академії Позитивної Психотерапії',
                        ]
                    ],
                    [
                        'name' => [
                            'ru' => 'Обучение в направлении NEST (работа с травмой, руководители Анжей Винклер, Витолд Симон), Польша. Участие в конференциях NEST',
                            'ua' => 'Навчання у напрямку NEST (робота з травмою, керівники Анжей Вінклер, Вітолд Сімон), Польща. Участь у конференціях NEST',
                        ]
                    ],
                    [
                        'name' => [
                            'ru' => 'Стажировка в психоневрологической больнице им. Павлова, руководитель Бялая М.П.',
                            'ua' => 'Стажування у психоневрологічній лікарні ім. Павлова, керівник Бяла М.П.',
                        ]
                    ],
                    [
                        'name' => [
                            'ru' => 'Сертификат, «Работа с тревогой, фобиями, паническими атаками у взрослых и детей», Институт Рационально-Интуитивной психотерапии «Я»',
                            'ua' => 'Сертифікат, «Робота з тривогою, фобіями, панічними атаками у дорослих та дітей», Інститут Раціонально-інтуїтивної психотерапії «Я»',
                        ]
                    ],
                    [
                        'name' => [
                            'ru' => 'Специализация «Детский и подростковый психотерапевт», Институт рационально-интуитивной психотерапии «Я»',
                            'ua' => 'Спеціалізація «Дитячий та підлітковий психотерапевт», Інститут раціонально-інтуїтивної психотерапії «Я»',
                        ]
                    ],
                    [
                        'name' => [
                            'ru' => 'Специализация «Семейное консультирование, консультирование пар», Институт рационально-интуитивной психотерапии «Я»',
                            'ua' => 'Спеціалізація «Сімейне консультування, консультування пар», Інститут раціонально-інтуїтивної психотерапії «Я»',
                        ]
                    ],
                    [
                        'name' => [
                            'ru' => 'Непрерывное повышение квалификации в супервизионных и интервизорских группах ВАПП, УИПП, конференциях, семинарах, тренингах NEST.',
                            'ua' => 'Безперервне підвищення кваліфікації у супервізійних та інтервізорських групах ВАПП, УІПП, конференціях, семінарах, тренінгах NEST.',
                        ]
                    ],
                ],
            ],

            'methods' => [
                self::METHOD_POSITIVE_PSYCHOTHERAPY,
                self::METHOD_COGNITIVE_BEHAVIORAL_THERAPY_CBT,

            ],
            'association_and_supervision' => [
                [
                    'ru' => 'Членкиня Всемирной ассоциации позитивной психотерапии.',
                    'ua' => 'Членкиня Всесвітньої асоціації позитивної психотерапії.',
                ],
                [
                    'ru' => 'Прошла 200+ часов супервизии и 300+ часов личной терапии',
                    'ua' => 'Пройшла 200+ годин супервізії та 300+ годин особистої терапії',
                ],
            ],
        ],
        Psiholog::PSIHOLOG_ID_IRYNA_KOLODA => [
            'singlePhrase' => 'cognitive_behavioral_psiholog',// Когнітивно-поведінковий терапевт
            'specialties' => [//тут список "спеціалізацій" (це на сторінці списка психологів вони виводяться)
                "Робота з ПТСР" => true,
                "Кризи та травми",
            ],
            'isNotTherapist' => true,
            'experience_years' => 3,//років досвіду
            'profile_courses' => 8,//профільних курсів
            'therapy_types' => [//види терапії
                self::THERAPY_TYPE_INDIVIDUAL,//
            ],
            'about' => [//про психолога
                'ru' => "
                <p>
В 2002 году окончила КНУ им. Тараса Шевченка по специальности психология, но последующие 19 лет посвятила бизнесу. Создала и возглавила рекламное агентство, успешно работавшее с международными компаниями и лидерами украинского рынка.
Все это время не оставляла психологическое консультирование и работала с такими запросами: несчастные отношения, болезненные разрывы и разводы, саморазвитие, мотивация, вдохновение, личностные достижения.
</p>

<p>
С началом полномасштабной войны начала работу в волонтерских проектах «Психологическая помощь украинцам во время войны» и «Расскажи мне». Используя в работе метод КПТ, эффективно работаю с запросами: страх, конфликтное консультирование, ПА, ГТР, депрессия и прочее.",

                'ua' => "
                <p>
У 2002 році закінчила КНУ ім. Тараса Шевченка, за фахом психологія, але подальші 19 років присвятила бізнесу. Створила і очолила рекламну агенцію, яка успішно працювала з міжнародними компаніями та лідерами українського ринку.
Весь цей час не полишала психологічне консультування та працювала з такими запитами: нещасливі стосунки, болісні розриви та розлучення, саморозвиток, мотивація, натхнення, особистісні досягнення.
</p>

<p>
З початком повномасштабної війни почала роботу у волонтескьких проектах «Психологічна допомога українцям під час війни» та «Розкажи мені». Використовуючи у роботі метод КПТ, ефективно працюю с запитами: страх, конфліктне консультування, ПА, ГТР, депресія та інше. 
</p>",
            ],
            'works_with' => [//теми, з якими працює

                TopicList::STRESS,
                TopicList::ANXIETY,
                TopicList::DEPRESSION,
                TopicList::PANIC_ATTACKS,
                TopicList::DECLINE_OF_STRENGTH,
                TopicList::LOW_SELF_ESTEEM,
                TopicList::HYPOCHONDRIA,
                TopicList::A_FEELING_OF_LONELINESS,
                TopicList::EMOTIONAL_DEPENDENCE,
                TopicList::RELATIONSHIP_WITH_A_PARTNER,
                TopicList::RELATIONSHIPS_IN_GENERAL_WITH_OTHERS,
                TopicList::DIFFICULTIES_WITH_ORIENTATION_ITS_SEARCH,
                TopicList::BURNOUT,
                TopicList::LACK_OF_MOTIVATION,
                TopicList::PROCRASTINATION,
                TopicList::I_DON_T_KNOW_WHAT_I_WANT_TO_DO,
                TopicList::CHANGE_JOB_LOSS,
                TopicList::WAR,
                TopicList::MOVING_EMIGRATING,
                TopicList::FINANCIAL_CHANGES,
                TopicList::BREAKUP_OF_RELATIONS_DIVORCE,
                TopicList::VIOLENCE,

            ],
            'education' => [//освіта
                'main_amount' => 1,//кількість основних освіт
                'additional_amount' => 8,//кількість додаткових освіт
                'list' => [
                    [
                        'years' => '1997 - 2002',
                        'name' => [
                            'ru' => 'Бакалавр психологии, «Киевский национальный университет им. Тараса Шевченка»',
                            'ua' => 'Бакалавр психології, «Київський національний університет ім. Тараса Шевченка»',
                        ]
                    ],
                    [
                        'years' => '2021',
                        'name' => [
                            'ru' => 'Основы КПТ, «Академия Современной Психологии»',
                            'ua' => 'Основи КПТ, «Академія Сучасної Психології»',
                        ]
                    ],
                    [
                        'years' => '2021',
                        'name' => [
                            'ru' => 'Психология стресса и способы борьбы с ним, «PROMETHEUS»',
                            'ua' => 'Психологія стресу та способи боротьби з ним, «PROMETHEUS»',
                        ]
                    ],
                    [
                        'years' => '2022',
                        'name' => [
                            'ru' => 'Эмоциональное выгорание (системный подход), «Академия Современной Психологии»',
                            'ua' => 'Емоційне вигорання (системний підхід), «Академія Сучасної Психології»',
                        ]
                    ],
                    [
                        'years' => '2022',
                        'name' => [
                            'ru' => 'Работа с ПТСР (КПТ), «Международный Институт психологии»',
                            'ua' => 'Робота з ПТСР (КПТ), «Міжнародний Інститут Психології»',
                        ]
                    ],
                    [
                        'years' => '2022',
                        'name' => [
                            'ru' => 'Психиатрия для психологов, «Международный Институт психологии»',
                            'ua' => 'Психіатрія для психологів, «Міжнародний Інститут Психології»',
                        ]
                    ],
                    [
                        'years' => '2022',
                        'name' => [
                            'ru' => 'Основы современной психосоматики, «Международный Институт психологии»',
                            'ua' => 'Основи сучасної психосоматики, «Міжнародний Інститут Психології»',
                        ]
                    ],
                    [
                        'years' => '2022',
                        'name' => [
                            'ru' => 'Квантовая психология, «Международный Институт психологии»',
                            'ua' => 'Квантова психологія, «Міжнародний Інститут Психології»',
                        ]
                    ],
                    [
                        'years' => '2022',
                        'name' => [
                            'ru' => 'Основы Гештальт-терапии, «Международный Институт психологии»',
                            'ua' => 'Основи Гештальт-терапії, «Міжнародний Інститут Психології»',
                        ]
                    ],
                ],
            ],
            'methods' => [
                self::METHOD_COGNITIVE_BEHAVIORAL_THERAPY_CBT,
                self::METHOD_GESTALT_THERAPY,
                self::METHOD_COACHING,
                self::METHOD_ART_THERAPY,
            ],
            'association_and_supervision' => [
                [
                    'ru' => 'Прошла 50 часов супервизии',
                    'ua' => 'Пройшла 50 годин супервізії',
                ],
                [
                    'ru' => 'Членкиня Украинской Ассоциации Арт-терапевтов',
                    'ua' => 'Членкиня Української Асоціації Арт-терапевтів',
                ],
            ],
        ],
        Psiholog::PSIHOLOG_ID_OKSANA_RYZHIKOVA => [
            'singlePhrase' => 'expert_psichosomatics', // Клінічний та сімейний психолог
            'specialties' => [
                "Psychosomatics",
                "Child_parent_relations" => true,
                "Anxiety_apathy_depression",
                "Panic_attacks",
            ],
            'experience_years' => 11,
            'profile_courses' => 5,
            'therapy_types' => [
                self::THERAPY_TYPE_INDIVIDUAL,
                self::THERAPY_TYPE_COUPLE,
                self::THERAPY_TYPE_TEENAGER,
            ],
            'about' => [
                'ru' => "
                <p>
В психологию я пришла когда переживала личный кризис: семейный, возрастной и профессиональный. Вечный вопрос смысла жизни тоже не давал покоя, несколько лет я работала с терапевтом и благодаря этому сохранила семью и поменяла профессию.</p>

<p>
Теперь считаю что могу помочь измениться многим, гармонизировать жизнь, иметь смелость быть собой, работать и жить в комфортном темпе, нарабатывая необходимые ресурсы для радости и удовольствия.
</p>
                ",
                'ua' => "
                <p>
                У психологію я прийшла, коли переживала особисту кризу: сімейну, вікову та професійну. Вічне питання сенсу життя теж не давало спокою, кілька років я працювала з терапевтом і завдяки цьому зберегла сім'ю та поміняла професію.

</p>

                <p>
Тепер вважаю, що можу допомогти змінитись багатьом, гармонізувати життя, мати сміливість бути собою, працювати та жити в комфортному темпі, напрацьовуючи необхідні ресурси для радості та задоволення.
</p>
                ",
            ],
            'works_with' => [
                TopicList::STRESS,
                TopicList::ANXIETY,
                TopicList::DEPRESSION,
                TopicList::PANIC_ATTACKS,
                TopicList::DECLINE_OF_STRENGTH,
                TopicList::LOW_SELF_ESTEEM,
                TopicList::MOOD_SWINGS,
                TopicList::IRRITABILITY,
                TopicList::AGGRESSION,
                TopicList::SLEEP_PROBLEMS,
                TopicList::A_FEELING_OF_LONELINESS,
                TopicList::EMOTIONAL_DEPENDENCE,
                TopicList::HYPOCHONDRIA,
                TopicList::EATING_DISORDER,
                TopicList::RELATIONSHIP_WITH_A_PARTNER,
                TopicList::RELATIONS_WITH_PARENTS,
                TopicList::RELATIONSHIP_WITH_CHILDREN,
                TopicList::RELATIONSHIPS_IN_GENERAL_WITH_OTHERS,
                TopicList::DIFFICULTIES_WITH_ORIENTATION_ITS_SEARCH,
                TopicList::BURNOUT,
                TopicList::LACK_OF_MOTIVATION,
                TopicList::PROCRASTINATION,
                TopicList::I_DON_T_KNOW_WHAT_I_WANT_TO_DO,
                TopicList::CHANGE_JOB_LOSS,
                TopicList::WAR,
                TopicList::LOSS_OF_A_LOVED_ONE,
                TopicList::MOVING_EMIGRATING,
                TopicList::PREGNANCY,
                TopicList::BIRTH_OF_A_CHILD,
                TopicList::FINANCIAL_CHANGES,
                TopicList::BREAKUP_OF_RELATIONS_DIVORCE,
                TopicList::TREASON,
                TopicList::VIOLENCE,
                TopicList::ILLNESS_RELATIVES,
                TopicList::PSYCHOSOMATICS,
            ],
            'education' => [
                'main_amount' => 1,
                'additional_amount' => 5,
                'list' => [
                    [
                        'years' => '2013 - 2015',
                        'name' => [
                            'ru' => 'Магистр психологии, «Национальный педагогический университет имени М.Драгоманова»',
                            'ua' => 'Магістр психології, «Національний педагогічний університет імені М.Драгоманова»',
                        ]
                    ],
                    [
                        'years' => '2010 - 2014',
                        'name' => [
                            'ru' => 'I и II ступень «Теория и практика в гештальт-терапии», «Украинский гештальт институт',
                            'ua' => 'І та ІІ ступінь «Теорія та практика в гештальт-терапії», «Український гештальт інститут',
                        ]
                    ],
                    [
                        'years' => '2012 - 2014',
                        'name' => [
                            'ru' => 'Специализация «Робота з психосоматичними розладами в клінічній гештальт-терапії»',
                            'ua' => 'Спеціалізація «Работа с психосоматическими расстройствами в клинической гештальт-терапии»',
                        ]
                    ],
                    [
                        'years' => '2012',
                        'name' => [
                            'ru' => 'Семинар по психоанализу доктора Нэнси Мак-Уильямс',
                            'ua' => 'Семінар по психоаналізу доктора Ненсі Мак-Вільямс',
                        ]
                    ],
                    [
                        'years' => '2011',
                        'name' => [
                            'ru' => 'Семинар «Психиатрическая пропедевтика»',
                            'ua' => 'Семінар «Психіатрична пропедевтика»',
                        ]
                    ],
                    [
                        'years' => '2011-2016',
                        'name' => [
                            'ru' => 'Посещение Украинской гештальт-конференции',
                            'ua' => 'Відвідування Української гештальт- конференції',
                        ]
                    ],
                ],
            ],
            'methods' => [
                self::METHOD_GESTALT_THERAPY,
                self::METHOD_COGNITIVE_BEHAVIORAL_THERAPY_CBT,
                self::METHOD_ART_THERAPY
            ],
            'association_and_supervision' => [

                [
                    'ru' => 'Прошла 350 часов супервизии и 650 часов личной терапии',
                    'ua' => 'Пройшла 350 годин супервізії та 650 годин особистої терапії',
                ],
            ],
        ],
        Psiholog::PSIHOLOG_ID_YULIYA_GURNEVICH => [
            'singlePhrase' => 'career_couch',
            'specialties' => [
                "Adolescent_and_family_psychologist",
                "Career_orientation_of_youth_and_adults" => true,
            ],
            'experience_years' => 12,
            'profile_courses' => 4,
            'therapy_types' => [
                self::THERAPY_TYPE_INDIVIDUAL,
                self::THERAPY_TYPE_COUPLE,
                self::THERAPY_TYPE_TEENAGER,
            ],
            'about' => [
                'ru' => "
                <p>
Я с детства испытывала желание помогать людям, еще до окончания школы я знала что хочу в медицину.
Поступив в медицинское училище, мне все очень нравилось, но попав на практику в стационарное отделение больницы я поняла, что там работать не смогу. Делая инъекции, я словно ощущала их на себе, уровень эмпатии зашкаливал. Тогда я решила идти на психолога.
После получения диплома магистра я углубилась в отточку навыков психолога, стала специалистом по определению сильных сторон и карьерному развитию личности. Начиная со школьников, которые приходили определить свои интересы и способности к профессиям, заканчивая взрослыми, которые искали себя и свое место в социуме. Работала также с их самоценностью и самооценкой, мы затрагивали немало страхов перед новыми возможностями.

</p>

                <p>
К 2016 году я обрела уверенность и желание делиться знаниями, и решила создать свой профориентационный проект – «Академия юного профессионала», для детей и подростков 6-17 лет.
Желание показать разнообразие специальностей, выявить профессиональные интересы, найти свое любимое дело, дать детям возможность попробовать свои силы в профессиях и научить основным навыкам будущего, активизируя тем самым осознание выбора пути.

Так я стала руководителем и овладела еще многими профессиями, и более 1000 клиентов определили свою специальность.
Индивидуальность в работе и ясность в знаниях очень важна, ведь каждый человек уникален.

</p>
                ",
                'ua' => "
                <p>
                Я з дитинства відчувала бажання допомагати людям, ще до закінчення школи я знала що хочу в медицину.
Вступивши до медичного училища мені все дуже подобалося, але потрапивши на практику до стаціонарного відділення лікарні, я зрозуміла, що там працювати не зможу. Роблячи ін'єкції, я ніби відчувала їх на собі, рівень емпатії зашкалював. Тоді я вирішила йти на психолога.
Після отримання диплома магістра я поглибилася у відточування навичок психолога, стала фахівцем з визначення сильних сторін та кар'єрного розвитку особистості. Починаючи зі школярів, які приходили визначити свої інтереси та здібності до професій, та закінчуючи дорослими, які шукали себе та своє місце у соціумі. Працювала також з їхньою самоцінністю та самооцінкою, торкалися чимало страхів перед новими можливостями.

</p>

                <p>
До 2016 року я здобула впевненість, і бажання ділитися знаннями та вирішила створити свій профорієнтаційний проект – «Академія юного професіонала» для дітей та підлітків 6-17 років.
Бажання показати різноманітність спеціальностей, виявити професійні інтереси, знайти свою улюблену справу, дати дітям можливість спробувати свої сили в професіях та навчити основним навичкам майбутнього, тим самим активізуючи усвідомлення вибору шляху.

Так я стала керівником і опанувала ще багато професій, і понад 1000 клієнтів визначили свою спеціальність.
Індивідуальність у роботі та ясність у знаннях дуже важлива, адже кожна людина є унікальною.

</p>
                ",
            ],
            'works_with' => [
                TopicList::STRESS,
                TopicList::ANXIETY,
                TopicList::DECLINE_OF_STRENGTH,
                TopicList::LOW_SELF_ESTEEM,
                TopicList::MOOD_SWINGS,
                TopicList::IRRITABILITY,
                TopicList::AGGRESSION,
                TopicList::A_FEELING_OF_LONELINESS,
                TopicList::EMOTIONAL_DEPENDENCE,
                TopicList::HYPOCHONDRIA,
                TopicList::RELATIONSHIP_WITH_A_PARTNER,
                TopicList::RELATIONS_WITH_PARENTS,
                TopicList::RELATIONSHIP_WITH_CHILDREN,
                TopicList::RELATIONSHIPS_IN_GENERAL_WITH_OTHERS,
                TopicList::DIFFICULTIES_WITH_ORIENTATION_ITS_SEARCH,
                TopicList::BURNOUT,
                TopicList::LACK_OF_MOTIVATION,
                TopicList::PROCRASTINATION,
                TopicList::I_DON_T_KNOW_WHAT_I_WANT_TO_DO,
                TopicList::CHANGE_JOB_LOSS,
                TopicList::MOVING_EMIGRATING,
                TopicList::FINANCIAL_CHANGES,
                TopicList::BREAKUP_OF_RELATIONS_DIVORCE,
                TopicList::TREASON,
            ],
            'education' => [
                'main_amount' => 1,
                'additional_amount' => 4,
                'list' => [
                    [
                        'years' => '2013 - 2015',
                        'name' => [
                            'ru' => 'Магистр психологии (с правом преподавания психологических дисциплин), Открытый международный университет развития человека «Украина»',
                            'ua' => 'Магістр психології (з правом викладання психологічних дисциплін), Відкритий міжнародний університет розвитку людини «Україна»',
                        ]
                    ],
                    [
                        'years' => '2018 - 2019',
                        'name' => [
                            'ru' => 'I ступень «Теория и практика в гештальт-терапии»',
                            'ua' => 'І ступінь «Теорія та практика в гештальт-терапії»',
                        ]
                    ],
                    [
                        'years' => '2021',
                        'name' => [
                            'ru' => 'Семинар «Психологическое консультирование при потере и горе», Рыбак Лариса»',
                            'ua' => 'Семінар «Психологічне консультування при втраті та горі», Рибак Лариса',
                        ]
                    ],
                    [
                        'years' => '2019-2020',
                        'name' => [
                            'ru' => 'Учебный курс «Системные семейные расстановки», Институт прикладной психологии и расстановочных практик',
                            'ua' => 'Навчальний курс «Системні сімейні розстановки», Інститут прикладної психології та розстановочних практик',
                        ]
                    ],
                    [
                        'years' => '2010',
                        'name' => [
                            'ru' => 'Семинар «Психологические и профориентационные тесты, диагностика»',
                            'ua' => 'Семінар «Психологічні та профорієнтаційні тести, діагностика»',
                        ]
                    ],
                ],
            ],
            'methods' => [
                self::METHOD_COACHING,
                self::METHOD_GESTALT_THERAPY,
                self::METHOD_ART_THERAPY,
                self::METHOD_CONSTELLATIONS,
            ],
            'association_and_supervision' => [

                [
                    'ru' => 'Прошла 200 часов супервизии и 150 часов личной терапии',
                    'ua' => 'Пройшла 200 годин супервізії та 150 годин особистої терапії',
                ],
            ],
        ],
        Psiholog::PSIHOLOG_ID_MIRABELLA_BELILOVSKA => [
            'singlePhrase' => 'gestalt_psiholog', //Гештальт-терапевт
            'specialties' => [
                "Crisis_and_trauma",
                "Interpersonal_relations" => true,
            ],
            'experience_years' => 14,
            'profile_courses' => 15,
            'therapy_types' => [
                self::THERAPY_TYPE_INDIVIDUAL,
            ],
            'about' => [
                'ru' => "
                <p>Вместе мы сможем ответить на такие важные вопросы:<br> 
- как улучшить отношения; <br>
- как быть счастливым; <br>
- как гармонизироваться; <br>
- как получать удовлетворение от жизни; <br>
- как не разрушать себя негативными эмоциями; <br>
- как улучшить самооценку и полюбить себя… <br>
За каждым вашим вопросом стоит желание улучшить свою жизнь и согласие на совместную работу в этом направлении. 
</p>
                ",
                'ua' => "
                <p>Разом ми зможемо відповісти на такі важливі питання:<br>
- як покращити відносини; <br>
- як бути щасливим; <br>
- як гармонізуватись; <br>
- як отримувати задоволення від життя; <br>
- як не руйнувати себе негативними емоціями; <br>
- як покращити самооцінку та полюбити себе… <br>
За кожним вашим питанням стоїть бажання покращити своє життя та згода на спільну роботу у цьому напрямку.
</p>
                ",
            ],
            'works_with' => [
                TopicList::STRESS,
                TopicList::ANXIETY,
                TopicList::DEPRESSION,
                TopicList::LOW_SELF_ESTEEM,
                TopicList::SLEEP_PROBLEMS,
                TopicList::A_FEELING_OF_LONELINESS,
                TopicList::EMOTIONAL_DEPENDENCE,
                TopicList::RELATIONSHIP_WITH_A_PARTNER,
                TopicList::RELATIONS_WITH_PARENTS,
                TopicList::RELATIONSHIP_WITH_CHILDREN,
                TopicList::RELATIONSHIPS_IN_GENERAL_WITH_OTHERS,
                TopicList::BURNOUT,
                TopicList::CHANGE_JOB_LOSS,
                TopicList::WAR,
                TopicList::LOSS_OF_A_LOVED_ONE,
                TopicList::MOVING_EMIGRATING,
                TopicList::BREAKUP_OF_RELATIONS_DIVORCE,
                TopicList::TREASON,
                TopicList::ILLNESS_RELATIVES,
                TopicList::PSYCHOSOMATICS,
            ],
            'education' => [
                'main_amount' => 1,
                'additional_amount' => 15,
                'list' => [
                    [
                        'years' => '1986 - 1991',
                        'name' => [
                            'ru' => 'Бакалавр "Преподаватель психологии", «Киевский Педагогический Институт им. Горького»',
                            'ua' => 'Бакалавр "Викладач психології", «Київський Педагогічний Інститут їм. Горького»',
                        ]
                    ],
                    [
                        'years' => '2008 - 2017',
                        'name' => [
                            'ru' => 'I,II и III ступень «Теория и практика в гештальт-терапии», «Киевский Институт Гештальта и Психодрамы»',
                            'ua' => 'I,II та III ступінь «Теорія та практика в гештальт-терапії», «Київський Інститут Гештальту та Психодрами»',
                        ]
                    ],
                    [
                        'years' => '2018-2022',
                        'name' => [
                            'ru' => 'III ступень во «Французском Институте Гештальт-терапии Жан-Мари Робина»',
                            'ua' => 'III ступінь у «Французькому Інституті Гештальт-терапії Жан-Марі Робіна»',
                        ]
                    ],
                    [
                        'years' => '2018',
                        'name' => [
                            'ru' => 'Сертификат «Основы гештальт-коучинга», «Киевский Институт Гештальта и Психодрамы»',
                            'ua' => 'Сертифікат «Основи гештальт-коучинга», «Київський Інститут Гештальту та Психодрами»',
                        ]
                    ],
                    [
                        'years' => '2017-2018',
                        'name' => [
                            'ru' => 'Сертификат «Экзистенциальная парадигма в гештальт-терапии», ВОППГП',
                            'ua' => 'Сертифікат «Екзистенціальна парадигма в гештальт-терапії», ВОППГП',
                        ]
                    ],
                    [
                        'years' => '2017',
                        'name' => [
                            'ru' => 'Сертификат повышения квалификации «Теория Супервизии», Джей Левин',
                            'ua' => 'Сертифікат підвищення кваліфікації «Теорія Супервізії», Джей Левін',
                        ]
                    ],
                    [
                        'years' => '2016',
                        'name' => [
                            'ru' => 'Сертификат повышения квалификации «Групповой процесс и теория поля», Джей Левин и «Клиент-терапевтические отношения. Влияние семейной системы на терапию» Анна Танальская-Дулеба',
                            'ua' => 'Сертифікат підвищення кваліфікації «Груповий процес і теорія поля», Джей Левін та «Клієнт-терапевтичні стосунки. Вплив сімейної системи на терапію» ,Анна Танальська-Дулєба',
                        ]
                    ],
                    [
                        'years' => '2015',
                        'name' => [
                            'ru' => 'Сертификат повышения квалификации «Работа с группами. Феноменологический подход» и «Работа с полярностями. Диалог», Джей Левин',
                            'ua' => 'Сертифікат підвищення кваліфікації «Робота з групами. Феноменологічний підхід» та «Робота з полярностями. Діалог», Джей Левін',
                        ]
                    ],
                    [
                        'years' => '2013 - 2015',
                        'name' => [
                            'ru' => 'Специализация «Работа с травмами развития (эффект бабочки)», «Киевский Институт Гештальта и Психодрамы»',
                            'ua' => 'Спеціалізація «Робота з травмами розвитку (ефект метелика)», «Київський Інститут Гештальту та Психодрами»',
                        ]
                    ],
                    [
                        'years' => '2013 - 2015',
                        'name' => [
                            'ru' => 'ССертификат «Тайна и смысл сновидений» и «Работа в психологическом консультировании с метафорическими картами», «Центр Практической Психологии АНКОР»',
                            'ua' => 'Сертифікат «Тайна та сенс сновидінь» та «Робота в психологічному консультуванні з метафоричними картами», «Центр Практичної Психології АНКОР»',
                        ]
                    ],
                    [
                        'years' => '2012-2015',
                        'name' => [
                            'ru' => 'Сертификат «Кататимное переживание образов, Символдрама (А1, А2, В1, В2, С1, С2, С3)»',
                            'ua' => 'Сертифікат «Кататимне переживання образів, Символдрама (А1,А2, В1,В2, С1, С2, С3)»',
                        ]
                    ],
                    [
                        'years' => '2013 - 2014',
                        'name' => [
                            'ru' => 'Сертификат «Техники Арт-терапии в Транзакционном Анализе»',
                            'ua' => 'Сертифікат «Техніки Арт-терапії в Транзакційному Аналізі»',
                        ]
                    ],
                    [
                        'years' => '2013',
                        'name' => [
                            'ru' => 'Сертификат «Актуальные вопросы психотерапии», «Украинская Военно-Медицинская Академия»',
                            'ua' => 'Сертифікат «Актуальні питання психотерапії», «Українська Військово-Медична Академія»',
                        ]
                    ],
                    [
                        'years' => '2013',
                        'name' => [
                            'ru' => 'Сертификат «Психологическая медицина: Психосоматика и гомеопатия»',
                            'ua' => 'Сертифікат «Психологічна медицина: Психосоматика та гомеопатія»',
                        ]
                    ],
                    [
                        'years' => '2013',
                        'name' => [
                            'ru' => 'І и ІІ ступень «Холодинамики», профессор Л.А.Попова',
                            'ua' => 'І та ІІ ступінь «Холодинаміки», професор Л.А.Попова',
                        ]
                    ],
                    [
                        'years' => '2013',
                        'name' => [
                            'ru' => 'Свидетельство о прохождении курса обучения кататимно-иммагитимной психотерапии: «Современный психоанализ и Символдрама в диагностике и психотерапии нарциссических расстройств», Я.Л. Обухов',
                            'ua' => 'Свідоцтво про проходження курсу навчання кататимно-імагітимній психотерапії: «Сучасний психоаналіз та Символдрама у діагностиці та психотерапії нарцисичних розладів», Я.Л. Обухов',
                        ]
                    ],
                ],
            ],
            'methods' => [
                self::METHOD_GESTALT_THERAPY,
                self::METHOD_BODY_THERAPY,
                self::METHOD_CLIENT_CENTERED_PSYCHOTHERAPY,
                self::METHOD_COACHING,
                self::METHOD_PSYCHODRAMA,
                self::METHOD_EXISTENTIAL_THERAPY,
                self::METHOD_ART_THERAPY
            ],
            'association_and_supervision' => [
                [
                    'ru' => 'Членкиня Европейской Ассоциации Гештальт Терапии',
                    'ua' => 'Членкиня Європейської Асоціації Гештальт Терапії',
                ],
                [
                    'ru' => 'Членкиня Восточно-украинской ассоциации арт-терапии',
                    'ua' => 'Членкиня Східноукраїнської асоціації арт-терапії',
                ],
                [
                    'ru' => 'Прошла 700+ часов супервизии и 700+ часов личной терапии',
                    'ua' => 'Пройшла 700+ годин супервізії та 700+ годин особистої терапії',
                ],
            ],
        ],
        Psiholog::PSIHOLOG_ID_ARTEM_KHMELEVSKIY => [
            'singlePhrase' => 'specialist_anxiety_depression',
            'specialties' => [
                "Readaptation_of_servicemen",
                "Depression_anxiety_fears" => true,
                "Family_psychotherapy",
                "Psychosomatics",
            ],
            'experience_years' => 11,
            'profile_courses' => 9,
            'therapy_types' => [
                self::THERAPY_TYPE_INDIVIDUAL,
                self::THERAPY_TYPE_COUPLE,
                self::THERAPY_TYPE_TEENAGER,
            ],
            'about' => [
                'ru' => "
                <p>
Меня всегда интересовали вопросы, рецепты, способы: «Как жить счастливо?», «Как улучшить качество жизни?», «Что делать с психологической болью, дискомфортом?», «Как строить счастливые отношения?».
И в своей практике, вместе с клиентами мы ищем, пробуем, находим.</p>

<p>
Я был в браке 17 лет, сейчас разведен, дочь 13 лет, люблю велоспорт, книги, хорошую музыку, театр, кино.
</p>
                ",
                'ua' => "
                <p>
                Мене завжди цікавили питання, рецепти, способи: «Як жити щасливо?», «Як покращити якість життя?», «Що робити з психологічним болем, дискомфортом?», «Як будувати щасливі стосунки?».
І у своїй практиці, разом із клієнтами, ми шукаємо, пробуємо, знаходимо.

</p>

                <p>
Я був одружений 17 років, зараз розлучений, дочка 13 років. Люблю велоспорт, книги, хорошу музику, театр, кіно.
</p>
                ",
            ],
            'works_with' => [
                TopicList::STRESS,
                TopicList::ANXIETY,
                TopicList::DEPRESSION,
                TopicList::PANIC_ATTACKS,
                TopicList::DECLINE_OF_STRENGTH,
                TopicList::LOW_SELF_ESTEEM,
                TopicList::MOOD_SWINGS,
                TopicList::IRRITABILITY,
                TopicList::AGGRESSION,
                TopicList::SLEEP_PROBLEMS,
                TopicList::A_FEELING_OF_LONELINESS,
                TopicList::EMOTIONAL_DEPENDENCE,
                TopicList::HYPOCHONDRIA,
                TopicList::RELATIONSHIP_WITH_A_PARTNER,
                TopicList::RELATIONS_WITH_PARENTS,
                TopicList::RELATIONSHIP_WITH_CHILDREN,
                TopicList::RELATIONSHIPS_IN_GENERAL_WITH_OTHERS,
                TopicList::BURNOUT,
                TopicList::LACK_OF_MOTIVATION,
                TopicList::PROCRASTINATION,
                TopicList::I_DON_T_KNOW_WHAT_I_WANT_TO_DO,
                TopicList::CHANGE_JOB_LOSS,
                TopicList::WAR,
                TopicList::LOSS_OF_A_LOVED_ONE,
                TopicList::MOVING_EMIGRATING,
                TopicList::FINANCIAL_CHANGES,
                TopicList::BREAKUP_OF_RELATIONS_DIVORCE,
                TopicList::TREASON,
            ],
            'education' => [
                'main_amount' => 2,
                'additional_amount' => 9,
                'list' => [
                    [
                        'years' => '2016',
                        'name' => [
                            'ru' => 'Доктор философии (в области психологии), "Международная кадровая академия"',
                            'ua' => 'Доктор філософії (у галузі психології), "Міжнародна кадрова академія"',
                        ]
                    ],
                    [
                        'years' => '2012 - 2014',
                        'name' => [
                            'ru' => 'Магистр психологии, «Межрегиональная академия управления персоналом»',
                            'ua' => 'Магістр психології, «Міжрегіональна академія управління персоналом»',
                        ]
                    ],
                    [
                        'years' => '2012 - 2016',
                        'name' => [
                            'ru' => 'I и II ступень «Теория и практика в гештальт-терапии», «Украинский гештальт институт',
                            'ua' => 'І та ІІ ступінь «Теорія та практика в гештальт-терапії», «Український гештальт інститут',
                        ]
                    ],
                    [
                        'years' => '2016 - 2017',
                        'name' => [
                            'ru' => 'Специализация «Теория развития в Гештальт подходе: Возрастные кризисы»',
                            'ua' => 'Спеціалізація «Теорія розвитку в Гештальт підході: Вікові кризи»',
                        ]
                    ],
                    [
                        'years' => '2019 - 2022',
                        'name' => [
                            'ru' => 'Гештальт терапия в работе с детьми',
                            'ua' => 'Гештальт терапія у роботі з дітьми',
                        ]
                    ],
                    [
                        'name' => [
                            'ru' => 'Реадаптация военнослужащих и членов их семей',
                            'ua' => 'Реадаптація військовослужбовців та членів їх сімей',
                        ]
                    ],
                    [
                        'name' => [
                            'ru' => 'Основы групповой психотерапии',
                            'ua' => 'Основи групової психотерапії',
                        ]
                    ],
                    [
                        'name' => [
                            'ru' => 'Основы профессионального консультирования',
                            'ua' => 'Основи професійного консультування',
                        ]
                    ],
                    [
                        'name' => [
                            'ru' => 'Семейная психотерапия',
                            'ua' => 'Сімейна психотерапія',
                        ]
                    ],
                    [
                        'name' => [
                            'ru' => 'Психосоматика',
                            'ua' => 'Психосоматика',
                        ]
                    ],
                    [
                        'name' => [
                            'ru' => 'Психоанализ',
                            'ua' => 'Психоанализ',
                        ]
                    ],
                    [
                        'name' => [
                            'ru' => 'Работа с детьми и подростками',
                            'ua' => 'Робота з дітьми та підлітками',
                        ]
                    ],
                ],
            ],
            'methods' => [
                self::METHOD_GESTALT_THERAPY,
                self::METHOD_PSYCHOANALYSIS,
                self::METHOD_SYSTEMIC_FAMILY_THERAPY,
                self::METHOD_COGNITIVE_BEHAVIORAL_THERAPY_CBT,
            ],
            'association_and_supervision' => [
                [
                    'ru' => 'Член Всеукраинского Общества Психологов Практикующих Гештальт Подход, «Украинский Гештальт Институт»',
                    'ua' => 'Член Всеукраїнської Спілки Психологів, що Практикують Гештальт Підхід, «Український Гештальт Інститут»',
                ],
                [
                    'ru' => 'Прошел 50+ часов супервизии и 200 часов личной терапии',
                    'ua' => 'Прошел 50+ годин супервізії та 200 годин особистої терапії',
                ],
            ],
        ],
        Psiholog::PSIHOLOG_ID_NADEZHDA_TORDIYA => [
            'singlePhrase' => 'expert_crisis_and_trauma',
            'specialties' => [
                "Crisis_and_trauma",
                "Midlife_crises" => true,
            ],
            'experience_years' => 12,
            'profile_courses' => 5,
            'therapy_types' => [
                self::THERAPY_TYPE_INDIVIDUAL,
            ],
            'about' => [
                'ru' => "
                <p>
В последнее время актуальность обращения к психологам не вызывает сомнений. Конечно, вы можете попытаться решить проблему сами, но, обратившись к специалисту, вы не только ускорите процесс решения, но и пройдете этот путь максимально эффективно. 
</p>

<p>
Я помогу вам: <br>
- Разобраться вместе с Вами в истоках проблемы, найти варианты решений. <br>
- Избавиться от психологической боли, используя техники терапевтического метода, в котором сертифицирована. <br>
- Повысить уверенность в себе.
</p>
                <p>
Эффективно. Надежно. Конфиденциально. 
</p>
                ",
                'ua' => "
                <p>
                Останнім часом актуальність звернення до психологів не викликає сумнівів. Звичайно, ви можете спробувати вирішити проблему самі, але звернувшись до фахівця, ви не тільки прискорите процес вирішення, але й пройдете цей шлях максимально ефективно. 
</p>

<p>
Я допоможу вам:<br>
- Розібратися разом з Вами у витоках проблеми, знайти варіанти рішень.<br>
- Позбутися психологічного болю, використовуючи техніки терапевтичного методу, в якому сертифікована.<br>
- Підвищити впевненість у собі.
</p>
<p>
    Ефективно. Надійно. Конфіденційно.
</p>
                ",
            ],
            'works_with' => [
                TopicList::STRESS,
                TopicList::ANXIETY,
                TopicList::DECLINE_OF_STRENGTH,
                TopicList::LOW_SELF_ESTEEM,
                TopicList::IRRITABILITY,
                TopicList::AGGRESSION,
                TopicList::RELATIONSHIP_WITH_A_PARTNER,
                TopicList::RELATIONS_WITH_PARENTS,
                TopicList::RELATIONSHIPS_IN_GENERAL_WITH_OTHERS,
                TopicList::LACK_OF_MOTIVATION,
                TopicList::LOSS_OF_A_LOVED_ONE,
                TopicList::BREAKUP_OF_RELATIONS_DIVORCE,
            ],
            'education' => [
                'main_amount' => 1,
                'additional_amount' => 5,
                'list' => [
                    [
                        'years' => '2009 - 2010',
                        'name' => [
                            'ru' => 'Магистр психологии, «Международный Университет "Украина"»',
                            'ua' => 'Магістр психології, «Міжнародний Університет "Україна"»',
                        ]
                    ],
                    [
                        'years' => '2010 - 2019',
                        'name' => [
                            'ru' => 'Программа по клиент-центрированной психотерапии, Тренеры: проф.Кочарян А.С., доц.Жидко М.Е., доц.Кочарян И.О',
                            'ua' => 'Програма з клієнт-центрованої психотерапії, Тренери: проф.Кочарян О.С., доц.Жидко М.Є., доц.Кочарян І.О',
                        ]
                    ],
                    [
                        'years' => '2022',
                        'name' => [
                            'ru' => 'Специализация «Стабилизация в работе с травмой», Тренеры: Професор Джейн Айрленд, Акредитований психолог Кімберлі МакНіл',
                            'ua' => 'Спеціалізація «Стабілізація у роботі з травмою», Тренери: Професор Джейн Айрленд, Акредитований психолог Кімберлі МакНіл',
                        ]
                    ],
                    [
                        'years' => '2022',
                        'name' => [
                            'ru' => 'Специализация «Проработка темы страданий с помощью майндфулнесс и сострадания», Тренер: Dr. Bassam Khoury',
                            'ua' => 'Спеціалізація «Проработка теми страждань за допомогою майндфулнес та  співчуття», Тренер: Dr. Bassam Khoury',
                        ]
                    ],
                    [
                        'years' => '2022',
                        'name' => [
                            'ru' => 'Программа «Работа с травмой. Майндфулнес и терапия обязательства и принятия (АСТ)», Тренер: д-р Фахиме Шанхай',
                            'ua' => 'Програма «Робота за травмою. Майндфулнес і терапія зобов(&apos)язання та прийняття (АСТ)», Тренер: д-р Фахіме Шанхай',
                        ]
                    ],
                    [
                        'years' => '2022',
                        'name' => [
                            'ru' => 'Практикум психологической стойкости в условиях горя и травм. Тренер: Dr. Tina Montreuil',
                            'ua' => 'Практикум психологічної стійкости в умовах горя та травм. Тренер: Dr. Tina Montreuil',
                        ]
                    ],
                    [
                        'years' => '2014',
                        'name' => [
                            'ru' => 'Выездной тренинг «Восстановление энергии жизни», Тренер: Светлана Липинская',
                            'ua' => 'Виїзний тренінг «Відновлення енергії життя», Тренер: Світлана Липинська',
                        ]
                    ],
                ],
            ],
            'methods' => [
                self::METHOD_CLIENT_CENTERED_PSYCHOTHERAPY,
            ],
            'association_and_supervision' => [
                [
                    'ru' => 'Членкиня Национальной психологической ассоциации Украины',
                    'ua' => 'Членкиня Національної психологічної асоціації України',
                ],
                [
                    'ru' => 'Членкиня НВсеукраинского института клиент-центрированной психотерапии',
                    'ua' => 'Членкиня Всеукраїнського інституту клієнт-центрованої психотерапії',
                ],
                [
                    'ru' => 'Прошла 100+ часов супервизии и 200 часов личной терапии',
                    'ua' => 'Пройшла 100+ годин супервізії та 200 годин особистої терапії',
                ],
            ],
        ],
        Psiholog::PSIHOLOG_ID_NATALYA_PONOMAREVA => [
            'singlePhrase' => 'expert_crisis_and_trauma',
            'specialties' => [
                "Crisis_and_trauma",
                "Psychosomatics_and_physical_symptoms",
                "Loss_and_grief" => true,
                "Teenagers_and_their_families"
            ],
            'experience_years' => 12,
            'profile_courses' => 1,
            'therapy_types' => [
                self::THERAPY_TYPE_INDIVIDUAL,
                self::THERAPY_TYPE_TEENAGER,
            ],
            'about' => [
                'ru' => "
                <p>
Привет, я пережила много кризисов и по собственному опыту знаю, как помогает терапия. Мне очень нравится мое дело, хочу помогать людям и иду за клиентом в его темпе.</p>

<p>
Работаю с утратами и гореванием, кризисами, травмами, шоковыми состояниями, а также межличностными проблемами, изменами, семейными кризисами, одиночеством и расставаниями.
</p>
                ",
                'ua' => "
                <p>
                Привіт, я пережила багато криз і на власному досвіді знаю, як допомагає терапія. Мені дуже подобається моя справа, хочу допомагати людям, й іду за клієнтом у його темпі

</p>

                <p>
Працюю з втратами та горінням, кризами, травмами, шоковими станами, а також міжособистісними проблемами, зрадами, сімейними кризами, самотністю та розставаннями.
</p>
                ",
            ],
            'works_with' => [
                TopicList::STRESS,
                TopicList::ANXIETY,
                TopicList::DEPRESSION,
                TopicList::PANIC_ATTACKS,
                TopicList::DECLINE_OF_STRENGTH,
                TopicList::LOW_SELF_ESTEEM,
                TopicList::MOOD_SWINGS,
                TopicList::IRRITABILITY,
                TopicList::AGGRESSION,
                TopicList::SLEEP_PROBLEMS,
                TopicList::A_FEELING_OF_LONELINESS,
                TopicList::EMOTIONAL_DEPENDENCE,
                TopicList::HYPOCHONDRIA,
                TopicList::RELATIONSHIP_WITH_A_PARTNER,
                TopicList::RELATIONS_WITH_PARENTS,
                TopicList::RELATIONSHIP_WITH_CHILDREN,
                TopicList::RELATIONSHIPS_IN_GENERAL_WITH_OTHERS,
                TopicList::SEXUAL_PROBLEMS_DISORDERS,
                TopicList::BURNOUT,
                TopicList::LACK_OF_MOTIVATION,
                TopicList::PROCRASTINATION,
                TopicList::I_DON_T_KNOW_WHAT_I_WANT_TO_DO,
                TopicList::CHANGE_JOB_LOSS,
                TopicList::WAR,
                TopicList::LOSS_OF_A_LOVED_ONE,
                TopicList::MOVING_EMIGRATING,
                TopicList::PREGNANCY,
                TopicList::BIRTH_OF_A_CHILD,
                TopicList::FINANCIAL_CHANGES,
                TopicList::BREAKUP_OF_RELATIONS_DIVORCE,
                TopicList::TREASON,
                TopicList::VIOLENCE,
                TopicList::ILLNESS_RELATIVES,
                TopicList::PSYCHOSOMATICS,
            ],
            'education' => [
                'main_amount' => 1,
                'additional_amount' => 1,
                'list' => [
                    [
                        'years' => '2004 - 2006',
                        'name' => [
                            'ru' => 'Магистр психологии, «Институт Психологии и Предпринимательства»',
                            'ua' => 'Магістр психології, «Інститут психології та підприємництва»',
                        ]
                    ],
                    [
                        'years' => '2014 - 2018',
                        'name' => [
                            'ru' => 'I и II ступень «Теория и практика в гештальт-терапии», «Киевский гештальт институт',
                            'ua' => 'І та ІІ ступінь «Теорія та практика в гештальт-терапії», «Киевский гештальт інститут',
                        ]
                    ],

                ],
            ],
            'methods' => [
                self::METHOD_GESTALT_THERAPY,
            ],
            'association_and_supervision' => [
                [
                    'ru' => 'Тренер, ведущая групп в Киевском гештальт институте',
                    'ua' => 'Тренер, ведуча груп у Київському гештальт інституті',
                ],
                [
                    'ru' => 'Прошла 200+ часов супервизии и 200+ часов личной терапии',
                    'ua' => 'Пройшла 200+ годин супервізії та 200+ годин особистої терапії',
                ],
            ],
        ],
        Psiholog::PSIHOLOG_ID_YULIYA_KANTAROVICH => [
            'singlePhrase' => 'gestalt_psiholog',
            'specialties' => [
                "Crisis_and_trauma",
                "Clinical_psychology" => true,
                "Depression_BAR",
            ],
            'has_psihologist_diploma' => false,
            'experience_years' => 4,
            'profile_courses' => 4,
            'therapy_types' => [
                self::THERAPY_TYPE_INDIVIDUAL,
                self::THERAPY_TYPE_COUPLE,
            ],
            'about' => [
                'ru' => "
                <p>
Мой путь в психотерапию начался с клиентского опыта.
Доброжелательное любопытство моего терапевта, её включенность и принятие помогли мне в исследовании своих потребностей и переживаний.
Мне стало любопытно, как устроен терапевтический процесс.
Так я попала в обучающую программу.
К тому моменту  мне было уже сорок лет. У меня был второй муж, двое сыновей и профессия педагога по фортепиано.</p>

<p>
Я с большим увлечением окунулась в новую профессию.
Мне нравится сопровождать клиента в его исследовании и самопознании, находить вместе с ним новые возможности, разделять переживания, поддерживать и быть рядом в непростые моменты жизни.
Я уверена, что психотерапия  - это путь к своим подлинным потребностям и ценностям. 
Это искусство быть собой, и искусство быть с другим, уважая его индивидуальность и границы.
</p>

<p>
Работаю с запросами:<br>
- Любовные, партнёрские, семейные отношения.<br>
- Каково быть родителем подростка.<br>
- Как пережить одиночество и развод.<br>
- Как прекратить токсичные отношения.<br>
- Трудности адаптации в другой стране.<br>
- Куда исчезло удовольствие от жизни.<br>
- Каковы мои потребности и цели.<br>
- Депрессия, БАР.

</p>
                ",
                'ua' => "
                <p>
                Мій шлях у психотерапію розпочався з клієнтського досвіду. Доброзичлива цікавість мого терапевта, її включеність та прийняття допомогли мені у дослідженні своїх потреб та переживань.
Мені стало цікаво, як влаштований терапевтичний процес. Так я потрапила до навчальної програми. На той момент мені було вже сорок років. У мене був другий чоловік, двоє синів та професія педагога з фортепіано.</p>

<p>
Я з великим захопленням поринула у нову професію.
Мені подобається супроводжувати клієнта в його дослідженні та самопізнанні, знаходити разом з ним нові можливості, розділяти переживання, підтримувати та бути поряд у непрості моменти життя.
Я впевнена, що психотерапія - це шлях до своїх справжніх потреб та цінностей.
Це мистецтво бути собою, і мистецтво бути з іншим, поважаючи його індивідуальність та межі.
</p>

<p>
Працюю із запитами:<br>
- Любовні, партнерські, сімейні стосунки.<br>
- Як бути батьком підлітка.<br>
- Як пережити самотність та розлучення.<br>
- Як припинити токсичні стосунки.<br>
- Проблеми адаптації в іншій країні.<br>
- Куди зникло задоволення від життя.<br>
- Які мої потреби та цілі.<br>
- Депресія, БАР.
</p>
                ",
            ],
            'works_with' => [
                TopicList::STRESS,
                TopicList::DEPRESSION,
                TopicList::MOOD_SWINGS,
                TopicList::EMOTIONAL_DEPENDENCE,
                TopicList::RELATIONSHIP_WITH_A_PARTNER,
                TopicList::RELATIONS_WITH_PARENTS,
                TopicList::RELATIONSHIP_WITH_CHILDREN,
                TopicList::RELATIONSHIPS_IN_GENERAL_WITH_OTHERS,
                TopicList::I_DON_T_KNOW_WHAT_I_WANT_TO_DO,
                TopicList::MOVING_EMIGRATING,
                TopicList::BREAKUP_OF_RELATIONS_DIVORCE,
            ],
            'education' => [
                'main_amount' => 1,
                'additional_amount' => 4,
                'list' => [
                    [
                        'years' => '1989 - 1995',
                        'name' => [
                            'ru' => 'Педагог, «ОГМА им. Неждановой»',
                            'ua' => 'Педагог, «ОДМА ім. Нежданової»',
                        ]
                    ],
                    [
                        'years' => '2014 - 2018',
                        'name' => [
                            'ru' => 'I и II ступень «Теория и практика в гештальт-терапии», «Украинский гештальт институт»',
                            'ua' => 'І та ІІ ступінь «Теорія та практика в гештальт-терапії», «Український гештальт інститут»',
                        ]
                    ],
                    [
                        'years' => '2018 - 2019',
                        'name' => [
                            'ru' => 'Специализация «Клинический подход в гештальт – терапии», «Украинский гештальт институт»',
                            'ua' => 'Спеціалізація «Клінічний підхід у гештальт – терапії», «Український гештальт інститут»',
                        ]
                    ],
                    [
                        'years' => '2017 - 2019',
                        'name' => [
                            'ru' => 'Специализация «Гештальт–терапия и системный подход в работе с семьей», «Украинский гештальт институт»',
                            'ua' => 'Спеціалізація «Гештальт–терапія та системний підхід у роботі з сімєю», «Український гештальт інститут»',
                        ]
                    ],
                    [
                        'years' => '2021',
                        'name' => [
                            'ru' => 'Развивающе-терапевтическая программа по глубинной психологии «Судьба анализ»',
                            'ua' => 'Розвиваюче-терапевтична програма з глибинної психології «Доля аналіз»',
                        ]
                    ],
                    [
                        'years' => '2022',
                        'name' => [
                            'ru' => 'Специализация «Кризисы и травмы», «Украинский гештальт институт»',
                            'ua' => 'Спеціалізація «Кризи та травми», «Український гештальт інститут»',
                        ]
                    ],
                ],
            ],
            'methods' => [
                self::METHOD_GESTALT_THERAPY,
                self::METHOD_SYSTEMIC_FAMILY_THERAPY,
                self::METHOD_ART_THERAPY,
            ],
            'association_and_supervision' => [
                [
                    'ru' => 'Членкиня Всеукраинского Общества Психологов Практикующих Гештальт Подход, «Украинский Гештальт Институт»',
                    'ua' => 'Членкиня Всеукраїнської Спілки Психологів, що Практикують Гештальт Підхід, «Український Гештальт Інститут»',
                ],
                [
                    'ru' => 'Прошла 250 часов супервизии и 400+ часов личной терапии',
                    'ua' => 'Пройшла 250 годин супервізії та 400+ годин особистої терапії',
                ],
            ],
        ],
        Psiholog::PSIHOLOG_ID_ZERO_MAN => [
            'singlePhrase' => 'gestalt_psiholog',
            'specialties' => [
                "Crisis_and_trauma",
                "Clinical_psychology" => true,
                "Depression_BAR",
            ],
            'has_psihologist_diploma' => false,
            'experience_years' => 4,
            'profile_courses' => 4,
            'therapy_types' => [
                self::THERAPY_TYPE_INDIVIDUAL,
                self::THERAPY_TYPE_COUPLE,
            ],
            'about' => [
                'ru' => "
                <p>
Мой путь в психотерапию начался с клиентского опыта.
Доброжелательное любопытство моего терапевта, её включенность и принятие помогли мне в исследовании своих потребностей и переживаний.
Мне стало любопытно, как устроен терапевтический процесс.
Так я попала в обучающую программу.
К тому моменту  мне было уже сорок лет. У меня был второй муж, двое сыновей и профессия педагога по фортепиано.</p>

<p>
Я с большим увлечением окунулась в новую профессию.
Мне нравится сопровождать клиента в его исследовании и самопознании, находить вместе с ним новые возможности, разделять переживания, поддерживать и быть рядом в непростые моменты жизни.
Я уверена, что психотерапия  - это путь к своим подлинным потребностям и ценностям. 
Это искусство быть собой, и искусство быть с другим, уважая его индивидуальность и границы.
</p>

<p>
Работаю с запросами:<br>
- Любовные, партнёрские, семейные отношения.<br>
- Каково быть родителем подростка.<br>
- Как пережить одиночество и развод.<br>
- Как прекратить токсичные отношения.<br>
- Трудности адаптации в другой стране.<br>
- Куда исчезло удовольствие от жизни.<br>
- Каковы мои потребности и цели.<br>
- Депрессия, БАР.

</p>
                ",
                'ua' => "
                <p>
                Мій шлях у психотерапію розпочався з клієнтського досвіду. Доброзичлива цікавість мого терапевта, її включеність та прийняття допомогли мені у дослідженні своїх потреб та переживань.
Мені стало цікаво, як влаштований терапевтичний процес. Так я потрапила до навчальної програми. На той момент мені було вже сорок років. У мене був другий чоловік, двоє синів та професія педагога з фортепіано.</p>

<p>
Я з великим захопленням поринула у нову професію.
Мені подобається супроводжувати клієнта в його дослідженні та самопізнанні, знаходити разом з ним нові можливості, розділяти переживання, підтримувати та бути поряд у непрості моменти життя.
Я впевнена, що психотерапія - це шлях до своїх справжніх потреб та цінностей.
Це мистецтво бути собою, і мистецтво бути з іншим, поважаючи його індивідуальність та межі.
</p>

<p>
Працюю із запитами:<br>
- Любовні, партнерські, сімейні стосунки.<br>
- Як бути батьком підлітка.<br>
- Як пережити самотність та розлучення.<br>
- Як припинити токсичні стосунки.<br>
- Проблеми адаптації в іншій країні.<br>
- Куди зникло задоволення від життя.<br>
- Які мої потреби та цілі.<br>
- Депресія, БАР.
</p>
                ",
            ],
            'works_with' => [
                TopicList::STRESS,
                TopicList::DEPRESSION,
                TopicList::MOOD_SWINGS,
                TopicList::EMOTIONAL_DEPENDENCE,
                TopicList::RELATIONSHIP_WITH_A_PARTNER,
                TopicList::RELATIONS_WITH_PARENTS,
                TopicList::RELATIONSHIP_WITH_CHILDREN,
                TopicList::RELATIONSHIPS_IN_GENERAL_WITH_OTHERS,
                TopicList::I_DON_T_KNOW_WHAT_I_WANT_TO_DO,
                TopicList::MOVING_EMIGRATING,
                TopicList::BREAKUP_OF_RELATIONS_DIVORCE,
            ],
            'education' => [
                'main_amount' => 1,
                'additional_amount' => 4,
                'list' => [
                    [
                        'years' => '1989 - 1995',
                        'name' => [
                            'ru' => 'Педагог, «ОГМА им. Неждановой»',
                            'ua' => 'Педагог, «ОДМА ім. Нежданової»',
                        ]
                    ],
                    [
                        'years' => '2014 - 2018',
                        'name' => [
                            'ru' => 'I и II ступень «Теория и практика в гештальт-терапии», «Украинский гештальт институт»',
                            'ua' => 'І та ІІ ступінь «Теорія та практика в гештальт-терапії», «Український гештальт інститут»',
                        ]
                    ],
                    [
                        'years' => '2018 - 2019',
                        'name' => [
                            'ru' => 'Специализация «Клинический подход в гештальт – терапии», «Украинский гештальт институт»',
                            'ua' => 'Спеціалізація «Клінічний підхід у гештальт – терапії», «Український гештальт інститут»',
                        ]
                    ],
                    [
                        'years' => '2017 - 2019',
                        'name' => [
                            'ru' => 'Специализация «Гештальт–терапия и системный подход в работе с семьей», «Украинский гештальт институт»',
                            'ua' => 'Спеціалізація «Гештальт–терапія та системний підхід у роботі з сімєю», «Український гештальт інститут»',
                        ]
                    ],
                    [
                        'years' => '2021',
                        'name' => [
                            'ru' => 'Развивающе-терапевтическая программа по глубинной психологии «Судьба анализ»',
                            'ua' => 'Розвиваюче-терапевтична програма з глибинної психології «Доля аналіз»',
                        ]
                    ],
                    [
                        'years' => '2022',
                        'name' => [
                            'ru' => 'Специализация «Кризисы и травмы», «Украинский гештальт институт»',
                            'ua' => 'Спеціалізація «Кризи та травми», «Український гештальт інститут»',
                        ]
                    ],
                ],
            ],
            'methods' => [
                self::METHOD_GESTALT_THERAPY,
                self::METHOD_SYSTEMIC_FAMILY_THERAPY,
                self::METHOD_ART_THERAPY,
            ],
            'association_and_supervision' => [
                [
                    'ru' => 'Членкиня Всеукраинского Общества Психологов Практикующих Гештальт Подход, «Украинский Гештальт Институт»',
                    'ua' => 'Членкиня Всеукраїнської Спілки Психологів, що Практикують Гештальт Підхід, «Український Гештальт Інститут»',
                ],
                [
                    'ru' => 'Прошла 250 часов супервизии и 400+ часов личной терапии',
                    'ua' => 'Пройшла 250 годин супервізії та 400+ годин особистої терапії',
                ],
            ],
        ],

        Psiholog::PSIHOLOG_ID_VIKTOR_DICHKO => [
            'singlePhrase' => 'expert_addictions',
            'specialties' => [
                "Addiction_specialist" => true,
                "Family_psychologist",
            ],
            'experience_years' => 12,
            'profile_courses' => 9,
            'therapy_types' => [
                self::THERAPY_TYPE_INDIVIDUAL,
                self::THERAPY_TYPE_COUPLE,
            ],
            'about' => [
                'ru' => "
                <p>
Я имею большой разноплановый, результативный опыт как: психолог, психотерапевт, экономист, инженер, руководитель, муж, отец.
Практика показала, что большинство наших сложностей и проблем начинаются из-за дефицита общения. Самый богатый внутренний мир вряд ли радует в одиночестве. Я знаю где начинается взаимопонимание и открывается возможность быть вместе. Вы получите общение, но не всего лишь общение.</p>
<p>
 Применяемые мной методы, методологии, подходы результат ориентированы, имеют практическую историю и постоянно усовершенствуются.
 Я продолжаю обучение в уникальном Народном Академическом Университете Эволюции Разума, открывающем новые возможности построения гармоничных отношений.
Работа в психологическом и закрытом наркологическом центре избавили от иллюзий и дали большой опыт помощи людям.
</p>
                ",
                'ua' => "
                <p>
                Я маю великий різноплановий, результативний досвід: як психолог, психотерапевт, економіст, інженер, керівник, чоловік, батько.
Практика показала, що більшість наших складнощів та проблем починаються через дефіцит спілкування. Найбагатший внутрішній світ навряд чи тішить на самоті. Я знаю, де починається взаєморозуміння і відкривається можливість бути разом.</p>
<p>
 Застосовувані мною методи, методології, підходи, результат орієнтовані, мають практичну історію і постійно вдосконалюються.
 Я продовжую навчання в унікальному Народному Академічному Університеті Еволюції Розуму, який відкриває нові можливості для побудови гармонійних відносин.
Робота в психологічному та закритому наркологічному центрі позбавили ілюзій та дали великий досвід допомоги людям.
</p>
                ",
            ],
            'works_with' => [
                TopicList::STRESS,
                TopicList::ANXIETY,
                TopicList::DEPRESSION,
                TopicList::PANIC_ATTACKS,
                TopicList::DECLINE_OF_STRENGTH,
                TopicList::LOW_SELF_ESTEEM,
                TopicList::MOOD_SWINGS,
                TopicList::IRRITABILITY,
                TopicList::AGGRESSION,
                TopicList::SLEEP_PROBLEMS,
                TopicList::A_FEELING_OF_LONELINESS,
                TopicList::EMOTIONAL_DEPENDENCE,
                TopicList::HYPOCHONDRIA,
                TopicList::EATING_DISORDER,
                TopicList::RELATIONSHIP_WITH_A_PARTNER,
                TopicList::RELATIONS_WITH_PARENTS,
                TopicList::RELATIONSHIP_WITH_CHILDREN,
                TopicList::RELATIONSHIPS_IN_GENERAL_WITH_OTHERS,
                TopicList::BURNOUT,
                TopicList::LACK_OF_MOTIVATION,
                TopicList::PROCRASTINATION,
                TopicList::I_DON_T_KNOW_WHAT_I_WANT_TO_DO,
                TopicList::CHANGE_JOB_LOSS,
                TopicList::WAR,
                TopicList::MOVING_EMIGRATING,
                TopicList::FINANCIAL_CHANGES,
                TopicList::BREAKUP_OF_RELATIONS_DIVORCE,
                TopicList::TREASON,
                TopicList::PSYCHOSOMATICS,
            ],
            'education' => [
                'main_amount' => 1,
                'additional_amount' => 9,
                'list' => [
                    [
                        'years' => '2013 - 2015',
                        'name' => [
                            'ru' => 'Магистр практической психологии, «Национальный педагогический университет им.М.П. Драгоманова»',
                            'ua' => 'Магістр практичної психології, «Національний педагогічний університет ім.М.П. Драгоманова»',
                        ]
                    ],
                    [
                        'years' => '2016',
                        'name' => [
                            'ru' => 'Программа «Инвариантное Моделирование», Международная высшая школа Академика А.Н. Малюты «Новый Универсум»',
                            'ua' => 'Програма «Інваріантне Моделювання», Міжнародна вища школа Академіка О.М. Малюти «Новий Універсум»',
                        ]
                    ],
                    [
                        'years' => '2013 - 2014',
                        'name' => [
                            'ru' => 'Конференции «Близость, привязанность, зависимость», «Диалог, присутствие и феноменология в гештальт-терапии» и «Рискуя Быть Живым», Московский гештальт институт',
                            'ua' => 'Конференції «Близькість, привязаність, залежність», «Діалог, присутність і феноменологія в гештальт-терапії» та «Ризикуючи Бути Живим», Московський гештальт інститут',
                        ]
                    ],
                    [
                        'years' => '2011 - 2012',
                        'name' => [
                            'ru' => 'Специализация «Гештальт-психотерапия зависимостей», Московский гештальт институт',
                            'ua' => 'Спеціалізація «Гештальт-психотерапія залежностей», Московський гештальт інститут',
                        ]
                    ],
                    [
                        'name' => [
                            'ru' => 'Программа «Диалоговая гештальт-терапия», Московский гештальт институт',
                            'ua' => 'Програма "Діалогова гештальт-терапія", Московський гештальт інститут',
                        ]
                    ],
                    [
                        'years' => '2011',
                        'name' => [
                            'ru' => 'Программа «Психоанализ и трансформационная лингвистика» и «Техника психоанализа», Украинская Ассоциация психоанализа ЕКППУ Международный институт Глубинной Психологии',
                            'ua' => 'Програма «Психоаналіз та трансформаційна лінгвістика» та «Техніка психоаналізу», Українська Асоціація психоаналізу ЄКППУ Міжнародний інститут Глибинної Психології',
                        ]
                    ],
                    [
                        'years' => '2010',
                        'name' => [
                            'ru' => 'Специализация «Самоизбавление от алкогольной и табачной зависимости, переедания и других вредных привычек, по методу Г.А. Шичко», Международная Ассоциация психоаналитиков при СБНТ',
                            'ua' => 'Спеціалізація «Самопозбавлення від алкогольної та тютюнової залежності, переїдання та інших шкідливих звичок, за методом Г.А. Шичко», Міжнародна Асоціація психоаналітиків при СБНТ',
                        ]
                    ],
                    [
                        'years' => '2010',
                        'name' => [
                            'ru' => 'Специализация «Зрительное переобучение по методу Шичко-Бейтса», Международная Ассоциация психоаналитиков при СБНТ',
                            'ua' => 'Спеціалізація «Зорове перенавчання за методом Шичко-Бейтса», Міжнародна Асоціація психоаналітиків при СБНТ',
                        ]
                    ],
                    [
                        'name' => [
                            'ru' => 'Программа «Базовый курс Ценности», «Методика VALUES», Виктория Андриевская',
                            'ua' => 'Програма "Базовий курс Цінності", "Методика VALUES", Вікторія Андрієвська',
                        ]
                    ],
                    [
                        'name' => [
                            'ru' => 'Программа «Система управления здоровьем» и «Открытый Диалог», Школа СУЗ',
                            'ua' => 'Програма «Система управління здоровям» та «Відкритий Діалог», Школа СУЗ',
                        ]
                    ],
                ],
            ],
            'methods' => [
                self::METHOD_GESTALT_THERAPY,
                self::METHOD_BODY_THERAPY,
                self::METHOD_COGNITIVE_BEHAVIORAL_THERAPY_CBT,
                self::METHOD_SYSTEMIC_FAMILY_THERAPY,
                self::METHOD_COACHING,
            ],
            'association_and_supervision' => [
                [
                    'ru' => 'Прошел 100+ часов супервизии и 150+ часов личной терапии',
                    'ua' => 'Пройшов 100+ годин супервізії та 150+ годин особистої терапії',
                ],
            ],
        ],
        Psiholog::PSIHOLOG_ID_ALISA_CHIZIKOVA => [
            'singlePhrase' => 'family_psiholog',
            'specialties' => [
                "Crisis_and_trauma",
                "Emotional_dependence" => true,
                "Psychosomatics",
                "Sexology",
            ],
            'experience_years' => 18,
            'profile_courses' => 16,
            'therapy_types' => [
                self::THERAPY_TYPE_INDIVIDUAL,
                self::THERAPY_TYPE_COUPLE,
                self::THERAPY_TYPE_TEENAGER,
            ],
            'about' => [
                'ru' => "
                <p>
В связи со сложными отношениями в семье и трудным подростковым возрастом я обратилась к психологу, и ощутила на себе целительное действие терапии! Так и решила посвятить ей свою жизнь. 
В 16 лет я начала обучаться психологии, в 18 лет стала пробовать работать с подростками, в 19 лет я начала изучать гештальт терапию в Московском гештальт институте, а с 20 лет я начала вести активную психологическую практику.</p>

<p>
Я люблю жизнь, самая большая ценность для меня — это моя семья. Я люблю проводить время с моими детьми. Я много путешествую по миру и люблю ходить в горы. Мне нравится кататься на велосипеде и читать книги. Я играю на клавишах и гитаре. Люблю новые знакомства, женские группы и телесные практики.
</p>
                ",
                'ua' => "
                <p>
                У зв'язку зі складними відносинами в сім'ї та важким підлітковим віком я звернулася до психолога, і відчула на собі цілющу дію терапії! Так і вирішила присвятити їй своє життя.
У 16 років я почала навчатися психології, у 18 років почала пробувати працювати з підлітками, у 19 років я почала вивчати гештальт терапію в Московському гештальт інституті, а з 20 років я почала вести активну психологічну практику.</p>

<p>
Я люблю життя, найбільша цінність для мене це моя сім'я. Я люблю проводити час із моїми дітьми. Я багато подорожую світом і люблю ходити в гори. Мені подобається кататися на велосипеді та читати книги. Я граю на клавішах та гітарі. Люблю нові знайомства, жіночі групи та тілесні практики.
</p>
                ",
            ],
            'works_with' => [
                TopicList::STRESS,
                TopicList::ANXIETY,
                TopicList::DEPRESSION,
                TopicList::PANIC_ATTACKS,
                TopicList::DECLINE_OF_STRENGTH,
                TopicList::LOW_SELF_ESTEEM,
                TopicList::MOOD_SWINGS,
                TopicList::IRRITABILITY,
                TopicList::AGGRESSION,
                TopicList::SLEEP_PROBLEMS,
                TopicList::A_FEELING_OF_LONELINESS,
                TopicList::EMOTIONAL_DEPENDENCE,
                TopicList::HYPOCHONDRIA,
                TopicList::RELATIONSHIP_WITH_A_PARTNER,
                TopicList::RELATIONS_WITH_PARENTS,
                TopicList::RELATIONSHIP_WITH_CHILDREN,
                TopicList::RELATIONSHIPS_IN_GENERAL_WITH_OTHERS,
                TopicList::SEXUAL_PROBLEMS_DISORDERS,
                TopicList::BURNOUT,
                TopicList::LACK_OF_MOTIVATION,
                TopicList::PROCRASTINATION,
                TopicList::I_DON_T_KNOW_WHAT_I_WANT_TO_DO,
                TopicList::CHANGE_JOB_LOSS,
                TopicList::LOSS_OF_A_LOVED_ONE,
                TopicList::MOVING_EMIGRATING,
                TopicList::PREGNANCY,
                TopicList::BIRTH_OF_A_CHILD,
                TopicList::FINANCIAL_CHANGES,
                TopicList::BREAKUP_OF_RELATIONS_DIVORCE,
                TopicList::TREASON,
                TopicList::VIOLENCE,
                TopicList::ILLNESS_RELATIVES,
                TopicList::PSYCHOSOMATICS,
            ],
            'education' => [
                'main_amount' => 1,
                'additional_amount' => 16,
                'list' => [
                    [
                        'name' => [
                            'ru' => 'Магистр практической психологии, «Национальный педагогический университет им.М.П. Драгоманова»',
                            'ua' => 'Магістр практичної психології, «Національний педагогічний університет ім.М.П. Драгоманова»',
                        ]
                    ],
                    [
                        'name' => [
                            'ru' => 'I и II ступень «Теория и практика в гештальт-терапии», «Московский  гештальт институт',
                            'ua' => 'І та ІІ ступінь «Теорія та практика в гештальт-терапії», «Московський гештальт інститут',
                        ]
                    ],
                    [
                        'years' => '2019 - 2022',
                        'name' => [
                            'ru' => 'Программа «Системные семейные расстановки», Голованова Е.Г.',
                            'ua' => 'Програма «Системні сімейні розстановки», Голованова Є.Г.',
                        ]
                    ],
                    [
                        'years' => '2017',
                        'name' => [
                            'ru' => 'Программа «Глубинное консультирование и работа с травмой», Центр «Дом отцовских объятий» ',
                            'ua' => 'Програма «Глибинне консультування та робота з травмою». Центр «Будинок батьківських обіймів»',
                        ]
                    ],
                    [
                        'years' => '2017',
                        'name' => [
                            'ru' => 'Программа «Управление временем и целеполагание»',
                            'ua' => 'Програма «Управління часом та цілепокладання»',
                        ]
                    ],
                    [
                        'name' => [
                            'ru' => 'Специализация «Работа с группами»',
                            'ua' => 'Спеціалізація «Робота з групами»',
                        ]
                    ],
                    [
                        'name' => [
                            'ru' => 'Специализация «Психосоматика, работа с симптомом» и «Лечение психосоматических болезней»',
                            'ua' => 'Спеціалізація «Психосоматика, робота із симптомом» та «Лікування психосоматичних хвороб»',
                        ]
                    ],
                    [
                        'name' => [
                            'ru' => 'Специализация «Сексология»',
                            'ua' => 'Спеціалізація «Сексологія»',
                        ]
                    ],
                    [
                        'name' => [
                            'ru' => 'Специализация «Семейная психотерапия»',
                            'ua' => 'Спеціалізація «Сімейна психотерапія»',
                        ]
                    ],
                    [
                        'name' => [
                            'ru' => 'Специализация «Эмоциональная травма», Программа «Комплексный метод Мюррей»',
                            'ua' => 'Спеціалізація "Емоційна травма", Програма "Комплексний метод Мюррей"',
                        ]
                    ],
                    [
                        'name' => [
                            'ru' => 'Специализация «Работа с детьми»',
                            'ua' => 'Спеціалізація «Робота з дітьми»',
                        ]
                    ],
                    [
                        'years' => '2008',
                        'name' => [
                            'ru' => 'Программа «MMPI» (Стандартизированный многофакторный метод исследования личности). Центр «Восхождение»',
                            'ua' => 'Програма «MMPI» (Стандартизований багатофакторний метод дослідження особистості), Центр «Сходження»',
                        ]
                    ],
                    [
                        'years' => '2007',
                        'name' => [
                            'ru' => 'Программа «Внутреннее исцеление», Центр «Ellel Ministries»',
                            'ua' => 'Програма «Внутрішнє зцілення». Центр «Ellel Ministries»',
                        ]
                    ],
                    [
                        'years' => '2006',
                        'name' => [
                            'ru' => 'Программа «Метод Мюррей» (работа с людьми пережившими травму), Центр «Реалис»',
                            'ua' => 'Програма «Метод Мюррей» (робота з людьми, які пережили травму), Центр «Реаліс»',
                        ]
                    ],
                    [
                        'years' => '2005',
                        'name' => [
                            'ru' => 'Программа Транзактный анализ, при ПХ ГПУ им. Сковороды',
                            'ua' => 'Програма Транзактний аналіз при ПХ ГПУ ім. Сковороди',
                        ]
                    ],
                    [
                        'years' => '2003',
                        'name' => [
                            'ru' => 'Программа «Работа с жертвами сексуального насилия», Центр «Становление»',
                            'ua' => 'Програма «Робота з жертвами сексуального насильства», Центр «Становлення»',
                        ]
                    ],
                    [
                        'years' => '2001 - 2002',
                        'name' => [
                            'ru' => 'Программа «Работа с подростками в группе» и «Работа со сложными подростками»',
                            'ua' => 'Програма «Робота з підлітками у групі» та «Робота зі складними підлітками»',
                        ]
                    ],
                ],
            ],
            'methods' => [
                self::METHOD_GESTALT_THERAPY,
                self::METHOD_ART_THERAPY,
                self::METHOD_CONSTELLATIONS,
            ],
            'association_and_supervision' => [
                [
                    'ru' => 'Прошла 300+ часов супервизии и 300+ часов личной терапии',
                    'ua' => 'Пройшла 300+ годин супервізії та 300+ годин особистої терапії',
                ],
            ],
        ],

    ];

    public function getAll(): array
    {
        $psihologList = self::PSIHOLOG_LIST;
        unset($psihologList[Psiholog::PSIHOLOG_ID_ZERO_MAN]);

        return $psihologList;
    }

    public function getFamily(): array
    {
        $family = [
            Psiholog::PSIHOLOG_ID_MARIYA_KOROYED,
            Psiholog::PSIHOLOG_ID_VIKTORIYA_RADIY,
            Psiholog::PSIHOLOG_ID_INNA_KARASHCHUK,
            Psiholog::PSIHOLOG_ID_OKSANA_RYZHIKOVA,
            Psiholog::PSIHOLOG_ID_SAN_SATTARI,
            Psiholog::PSIHOLOG_ID_ARTEM_KHMELEVSKIY,
            Psiholog::PSIHOLOG_ID_VIKTOR_DICHKO,
        ];

        return array_intersect_key(self::PSIHOLOG_LIST, array_flip($family));
    }

    public function getTeenager(): array
    {
        $family = [
            Psiholog::PSIHOLOG_ID_MARIYA_KOROYED,
            Psiholog::PSIHOLOG_ID_VIKTORIYA_RADIY,
            Psiholog::PSIHOLOG_ID_INNA_KARASHCHUK,
            Psiholog::PSIHOLOG_ID_OKSANA_RYZHIKOVA,
            Psiholog::PSIHOLOG_ID_YULIYA_GURNEVICH,
            Psiholog::PSIHOLOG_ID_ARTEM_KHMELEVSKIY,
            Psiholog::PSIHOLOG_ID_NATALYA_PONOMAREVA,
        ];

        return array_intersect_key(self::PSIHOLOG_LIST, array_flip($family));
    }

    public function get(int $psihologId): ?array
    {
        return self::PSIHOLOG_LIST[$psihologId] ?? null;
    }
}
